#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: 0967b8d8de008e97451d19c1c0a08ddb.pdb
; shader hash: 0967b8d8de008e97451d19c1c0a08ddb
;
; Buffer Definitions:
;
; cbuffer g_CameraInfo
; {
;
;   struct hostlayout.g_CameraInfo
;   {
;
;       struct hostlayout.struct.CameraInfo
;       {
;
;           column_major float4x4 mtxViewProj;        ; Offset:    0
;           column_major float4x4 mtxInverseViewProj; ; Offset:   64
;           float3 cameraEye;                         ; Offset:  128
;           float fElapsedTime;                       ; Offset:  140
;           column_major float4x4 mtxtarget;          ; Offset:  144
;           int bNormalMapping;                       ; Offset:  208
;           int bReflection;                          ; Offset:  212
;           int nMapNumber;                           ; Offset:  216
;       
;       } g_CameraInfo;                               ; Offset:    0
;
;   
;   } g_CameraInfo;                                   ; Offset:    0 Size:   220
;
; }
;
; cbuffer g_Lights
; {
;
;   struct g_Lights
;   {
;
;       struct struct.Lights
;       {
;
;           uint numLights;                           ; Offset:    0
;           float3 padding;                           ; Offset:    4
;           struct struct.Light
;           {
;
;               uint Type;                            ; Offset:   16
;               float3 Position;                      ; Offset:   20

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.7.2308.16 (52da17e29)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !138)
!1 = !DIFile(filename: "PBR_RayTracing.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !22, !31, !39}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 260, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 260, size: 288, align: 32, elements: !6, templateParams: !17)
!6 = !{!7, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !5, file: !1, line: 260, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !5, file: !1, line: 260, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !5, file: !1, line: 260, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !5, file: !1, line: 260, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !5, file: !1, line: 260, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !5, file: !1, line: 260, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !5, file: !1, line: 260, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !5, file: !1, line: 260, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !5, file: !1, line: 260, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!17 = !{!18, !19, !21}
!18 = !DITemplateTypeParameter(name: "element", type: !8)
!19 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 3)
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 263, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 263, size: 128, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !26, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 263, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 263, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 263, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, line: 263, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !{!18, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 4)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 188, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 188, size: 96, align: 32, elements: !33, templateParams: !37)
!33 = !{!34, !35, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !32, file: !1, line: 188, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !32, file: !1, line: 188, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !32, file: !1, line: 188, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!37 = !{!18, !38}
!38 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 3)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !41, templateParams: !44)
!41 = !{!42, !43}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !40, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !40, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !{!18, !45}
!45 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 2)
!46 = !{!47, !56, !57, !62, !63, !64, !67, !70, !73, !82, !86, !94, !97, !100, !103, !110, !116, !117, !118, !121, !124, !129, !132, !135}
!47 = !DISubprogram(name: "GetTex0FromBuffer", linkageName: "\01?GetTex0FromBuffer@@YAXY02$$CAV?$vector@M$01@@I@Z", scope: !1, file: !1, line: 156, type: !48, isLocal: false, isDefinition: true, scopeLine: 157, flags: DIFlagPrototyped, isOptimized: false)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !50, !54}
!50 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !51)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 192, align: 32, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 3)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !55)
!55 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!56 = !DISubprogram(name: "GetTex1FromBuffer", linkageName: "\01?GetTex1FromBuffer@@YAXY02$$CAV?$vector@M$01@@I@Z", scope: !1, file: !1, line: 173, type: !48, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: false)
!57 = !DISubprogram(name: "GetNormalFromBuffer", linkageName: "\01?GetNormalFromBuffer@@YAXY02$$CAV?$vector@M$02@@I@Z", scope: !1, file: !1, line: 190, type: !58, isLocal: false, isDefinition: true, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: false)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !60, !54}
!60 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 288, align: 32, elements: !52)
!62 = !DISubprogram(name: "GetTangentFromBuffer", linkageName: "\01?GetTangentFromBuffer@@YAXY02$$CAV?$vector@M$02@@I@Z", scope: !1, file: !1, line: 207, type: !58, isLocal: false, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: false)
!63 = !DISubprogram(name: "GetBiTangentFromBuffer", linkageName: "\01?GetBiTangentFromBuffer@@YAXY02$$CAV?$vector@M$02@@I@Z", scope: !1, file: !1, line: 224, type: !58, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: false)
!64 = !DISubprogram(name: "GetInterpolationHitFloat2", linkageName: "\01?GetInterpolationHitFloat2@@YA?AV?$vector@M$01@@Y02V1@V1@@Z", scope: !1, file: !1, line: 246, type: !65, isLocal: false, isDefinition: true, scopeLine: 247, flags: DIFlagPrototyped, isOptimized: false)
!65 = !DISubroutineType(types: !66)
!66 = !{!39, !51, !39}
!67 = !DISubprogram(name: "GetInterpolationHitFloat3", linkageName: "\01?GetInterpolationHitFloat3@@YA?AV?$vector@M$02@@Y02V1@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 252, type: !68, isLocal: false, isDefinition: true, scopeLine: 253, flags: DIFlagPrototyped, isOptimized: false)
!68 = !DISubroutineType(types: !69)
!69 = !{!31, !61, !39}
!70 = !DISubprogram(name: "GetHitNormalFromNormalMap", linkageName: "\01?GetHitNormalFromNormalMap@@YA?AV?$vector@M$02@@V1@00V?$vector@M$01@@@Z", scope: !1, file: !1, line: 258, type: !71, isLocal: false, isDefinition: true, scopeLine: 259, flags: DIFlagPrototyped, isOptimized: false)
!71 = !DISubroutineType(types: !72)
!72 = !{!31, !31, !31, !31, !39}
!73 = !DISubprogram(name: "TraceRadianceRay", linkageName: "\01?TraceRadianceRay@@YA?AV?$vector@M$03@@URayDesc@@I@Z", scope: !1, file: !1, line: 265, type: !74, isLocal: false, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: false)
!74 = !DISubroutineType(types: !75)
!75 = !{!22, !76, !54}
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 263, size: 256, align: 32, elements: !77)
!77 = !{!78, !79, !80, !81}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !76, file: !1, line: 263, baseType: !32, size: 96, align: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !76, file: !1, line: 263, baseType: !8, size: 32, align: 32, offset: 96)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !76, file: !1, line: 263, baseType: !32, size: 96, align: 32, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !76, file: !1, line: 263, baseType: !8, size: 32, align: 32, offset: 224)
!82 = !DISubprogram(name: "CheckTheShadow", linkageName: "\01?CheckTheShadow@@YA_NURayDesc@@I@Z", scope: !1, file: !1, line: 306, type: !83, isLocal: false, isDefinition: true, scopeLine: 307, flags: DIFlagPrototyped, isOptimized: false)
!83 = !DISubroutineType(types: !84)
!84 = !{!85, !76, !54}
!85 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!86 = !DISubprogram(name: "CalculateLighting", linkageName: "\01?CalculateLighting@@YA?AV?$vector@M$02@@URadiancePayload@@V1@M11@Z", scope: !1, file: !1, line: 344, type: !87, isLocal: false, isDefinition: true, scopeLine: 345, flags: DIFlagPrototyped, isOptimized: false)
!87 = !DISubroutineType(types: !88)
!88 = !{!31, !89, !31, !8, !31, !31}
!89 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !90)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "RadiancePayload", file: !1, line: 23, size: 160, align: 32, elements: !91)
!91 = !{!92, !93}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "RayColor", scope: !90, file: !1, line: 25, baseType: !22, size: 128, align: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "RayDepth", scope: !90, file: !1, line: 26, baseType: !54, size: 32, align: 32, offset: 128)
!94 = !DISubprogram(name: "CalculateFinalColor", linkageName: "\01?CalculateFinalColor@@YA?AV?$vector@M$03@@URadiancePayload@@V?$vector@M$02@@V1@IV?$vector@M$01@@3@Z", scope: !1, file: !1, line: 550, type: !95, isLocal: false, isDefinition: true, scopeLine: 551, flags: DIFlagPrototyped, isOptimized: false)
!95 = !DISubroutineType(types: !96)
!96 = !{!22, !89, !31, !22, !54, !39, !39}
!97 = !DISubprogram(name: "RayGenShader", linkageName: "\01?RayGenShader@@YAXXZ", scope: !1, file: !1, line: 652, type: !98, isLocal: false, isDefinition: true, scopeLine: 653, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGenShader@@YAXXZ")
!98 = !DISubroutineType(types: !99)
!99 = !{null}
!100 = !DISubprogram(name: "RadianceMiss", linkageName: "\01?RadianceMiss@@YAXURadiancePayload@@@Z", scope: !1, file: !1, line: 673, type: !101, isLocal: false, isDefinition: true, scopeLine: 674, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RadiancePayload*)* @"\01?RadianceMiss@@YAXURadiancePayload@@@Z")
!101 = !DISubroutineType(types: !102)
!102 = !{null, !89}
!103 = !DISubprogram(name: "ShadowMiss", linkageName: "\01?ShadowMiss@@YAXUShadowPayload@@@Z", scope: !1, file: !1, line: 687, type: !104, isLocal: false, isDefinition: true, scopeLine: 688, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.ShadowPayload*)* @"\01?ShadowMiss@@YAXUShadowPayload@@@Z")
!104 = !DISubroutineType(types: !105)
!105 = !{null, !106}
!106 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !107)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "ShadowPayload", file: !1, line: 29, size: 32, align: 32, elements: !108)
!108 = !{!109}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "bShadow", scope: !107, file: !1, line: 31, baseType: !85, size: 32, align: 32)
!110 = !DISubprogram(name: "RadianceAnyHit", linkageName: "\01?RadianceAnyHit@@YAXURadiancePayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 693, type: !111, isLocal: false, isDefinition: true, scopeLine: 694, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RadiancePayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?RadianceAnyHit@@YAXURadiancePayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!111 = !DISubroutineType(types: !112)
!112 = !{null, !89, !113}
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 690, size: 64, align: 32, elements: !114)
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !113, file: !1, line: 690, baseType: !40, size: 64, align: 32)
!116 = !DISubprogram(name: "ShadowAnyHit", linkageName: "\01?ShadowAnyHit@@YAXURadiancePayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 720, type: !111, isLocal: false, isDefinition: true, scopeLine: 721, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RadiancePayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ShadowAnyHit@@YAXURadiancePayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!117 = !DISubprogram(name: "RadianceClosestHit", linkageName: "\01?RadianceClosestHit@@YAXURadiancePayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 763, type: !111, isLocal: false, isDefinition: true, scopeLine: 764, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RadiancePayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?RadianceClosestHit@@YAXURadiancePayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!118 = !DISubprogram(name: "ShadowClosestHit", linkageName: "\01?ShadowClosestHit@@YAXUShadowPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 858, type: !119, isLocal: false, isDefinition: true, scopeLine: 859, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.ShadowPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ShadowClosestHit@@YAXUShadowPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!119 = !DISubroutineType(types: !120)
!120 = !{null, !106, !113}
!121 = !DISubprogram(name: "GetWorldPosition", linkageName: "\01?GetWorldPosition@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 241, type: !122, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: false)
!122 = !DISubroutineType(types: !123)
!123 = !{!31}
!124 = !DISubprogram(name: "CalculateCookTorranceSpecular", linkageName: "\01?CalculateCookTorranceSpecular@@YA?AV?$vector@M$02@@AIAV1@MV1@MMM@Z", scope: !1, file: !1, line: 325, type: !125, isLocal: false, isDefinition: true, scopeLine: 326, flags: DIFlagPrototyped, isOptimized: false)
!125 = !DISubroutineType(types: !126)
!126 = !{!31, !127, !8, !31, !8, !8, !8}
!127 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !31)
!129 = !DISubprogram(name: "GetFresnelusingSchlick", linkageName: "\01?GetFresnelusingSchlick@@YA?AV?$vector@M$02@@V1@M@Z", scope: !1, file: !1, line: 285, type: !130, isLocal: false, isDefinition: true, scopeLine: 286, flags: DIFlagPrototyped, isOptimized: false)
!130 = !DISubroutineType(types: !131)
!131 = !{!31, !31, !8}
!132 = !DISubprogram(name: "D_GGX", linkageName: "\01?D_GGX@@YAMMM@Z", scope: !1, file: !1, line: 290, type: !133, isLocal: false, isDefinition: true, scopeLine: 291, flags: DIFlagPrototyped, isOptimized: false)
!133 = !DISubroutineType(types: !134)
!134 = !{!8, !8, !8}
!135 = !DISubprogram(name: "GetSmithGeometry", linkageName: "\01?GetSmithGeometry@@YA?AV?$vector@M$02@@MMM@Z", scope: !1, file: !1, line: 297, type: !136, isLocal: false, isDefinition: true, scopeLine: 298, flags: DIFlagPrototyped, isOptimized: false)
!136 = !DISubroutineType(types: !137)
!137 = !{!31, !8, !8, !8}
!138 = !{!139, !141, !143, !147, !182, !204, !206, !226, !231, !233, !262, !276, !280, !282, !286, !287, !288, !289, !290, !294, !295, !296, !297, !298, !299, !300, !301}
!139 = !DIGlobalVariable(name: "RAY_FLAG_NONE", scope: !0, file: !1, line: 274, type: !140, isLocal: true, isDefinition: true, variable: i32 0)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!141 = !DIGlobalVariable(name: "g_Scene", linkageName: "\01?g_Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 119, type: !142, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?g_Scene@@3URaytracingAccelerationStructure@@A")
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 119, size: 32, align: 32, elements: !2)
!143 = !DIGlobalVariable(name: "uav", linkageName: "\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 121, type: !144, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!144 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 121, size: 128, align: 32, elements: !2, templateParams: !145)
!145 = !{!146}
!146 = !DITemplateTypeParameter(name: "element", type: !23)
!147 = !DIGlobalVariable(name: "g_CameraInfo", linkageName: "\01?g_CameraInfo@@3U?$ConstantBuffer@UCameraInfo@@@@A", scope: !0, file: !1, line: 123, type: !148, isLocal: false, isDefinition: true)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<CameraInfo>", file: !1, line: 123, size: 32, align: 32, elements: !2, templateParams: !149)
!149 = !{!150}
!150 = !DITemplateTypeParameter(name: "T", type: !151)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "CameraInfo", file: !1, line: 34, size: 1760, align: 32, elements: !152)
!152 = !{!153, !175, !176, !177, !178, !179, !180, !181}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "mtxViewProj", scope: !151, file: !1, line: 36, baseType: !154, size: 512, align: 32)
!154 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 123, size: 512, align: 32, elements: !155, templateParams: !172)
!155 = !{!156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !154, file: !1, line: 123, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !154, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !154, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !154, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !154, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !154, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !154, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !154, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !154, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !154, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !154, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !154, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !154, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !154, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !154, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !154, file: !1, line: 123, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!172 = !{!18, !173, !174}
!173 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 4)
!174 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 4)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "mtxInverseViewProj", scope: !151, file: !1, line: 37, baseType: !154, size: 512, align: 32, offset: 512)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "cameraEye", scope: !151, file: !1, line: 38, baseType: !31, size: 96, align: 32, offset: 1024)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "fElapsedTime", scope: !151, file: !1, line: 39, baseType: !8, size: 32, align: 32, offset: 1120)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "mtxtarget", scope: !151, file: !1, line: 40, baseType: !154, size: 512, align: 32, offset: 1152)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "bNormalMapping", scope: !151, file: !1, line: 41, baseType: !20, size: 32, align: 32, offset: 1664)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "bReflection", scope: !151, file: !1, line: 42, baseType: !20, size: 32, align: 32, offset: 1696)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nMapNumber", scope: !151, file: !1, line: 43, baseType: !20, size: 32, align: 32, offset: 1728)
!182 = !DIGlobalVariable(name: "g_Lights", linkageName: "\01?g_Lights@@3U?$ConstantBuffer@ULights@@@@A", scope: !0, file: !1, line: 124, type: !183, isLocal: false, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<Lights>", file: !1, line: 124, size: 32, align: 32, elements: !2, templateParams: !184)
!184 = !{!185}
!185 = !DITemplateTypeParameter(name: "T", type: !186)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lights", file: !1, line: 100, size: 32896, align: 32, elements: !187)
!187 = !{!188, !189, !190}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "numLights", scope: !186, file: !1, line: 102, baseType: !54, size: 32, align: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !186, file: !1, line: 103, baseType: !31, size: 96, align: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "lights", scope: !186, file: !1, line: 104, baseType: !191, size: 32768, align: 32, offset: 128)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 32768, align: 32, elements: !202)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light", file: !1, line: 88, size: 512, align: 32, elements: !193)
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !192, file: !1, line: 90, baseType: !54, size: 32, align: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !192, file: !1, line: 91, baseType: !31, size: 96, align: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Intensity", scope: !192, file: !1, line: 92, baseType: !8, size: 32, align: 32, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !192, file: !1, line: 93, baseType: !31, size: 96, align: 32, offset: 160)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Range", scope: !192, file: !1, line: 94, baseType: !8, size: 32, align: 32, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "SpotAngle", scope: !192, file: !1, line: 95, baseType: !8, size: 32, align: 32, offset: 288)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !192, file: !1, line: 96, baseType: !39, size: 64, align: 32, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !192, file: !1, line: 97, baseType: !22, size: 128, align: 32, offset: 384)
!202 = !{!203}
!203 = !DISubrange(count: 64)
!204 = !DIGlobalVariable(name: "g_EnviormentTexure", linkageName: "\01?g_EnviormentTexure@@3V?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 126, type: !205, isLocal: false, isDefinition: true, variable: %"class.TextureCube<vector<float, 4> >"* @"\01?g_EnviormentTexure@@3V?$TextureCube@V?$vector@M$03@@@@A")
!205 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 126, size: 128, align: 32, elements: !2, templateParams: !145)
!206 = !DIGlobalVariable(name: "g_TerrainInfo", linkageName: "\01?g_TerrainInfo@@3U?$ConstantBuffer@UTerrainCBV@@@@A", scope: !0, file: !1, line: 128, type: !207, isLocal: false, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<TerrainCBV>", file: !1, line: 128, size: 32, align: 32, elements: !2, templateParams: !208)
!208 = !{!209}
!209 = !DITemplateTypeParameter(name: "T", type: !210)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "TerrainCBV", file: !1, line: 107, size: 512, align: 32, elements: !211)
!211 = !{!212, !213, !214, !224, !225}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "numLayer", scope: !210, file: !1, line: 109, baseType: !54, size: 32, align: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !210, file: !1, line: 110, baseType: !31, size: 96, align: 32, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "bHasDiffuse", scope: !210, file: !1, line: 111, baseType: !215, size: 128, align: 32, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "int4", file: !1, line: 128, baseType: !216)
!216 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 4>", file: !1, line: 128, size: 128, align: 32, elements: !217, templateParams: !222)
!217 = !{!218, !219, !220, !221}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !216, file: !1, line: 128, baseType: !20, size: 32, align: 32, flags: DIFlagPublic)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !216, file: !1, line: 128, baseType: !20, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !216, file: !1, line: 128, baseType: !20, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !216, file: !1, line: 128, baseType: !20, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!222 = !{!223, !30}
!223 = !DITemplateTypeParameter(name: "element", type: !20)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "bHasNormal", scope: !210, file: !1, line: 112, baseType: !215, size: 128, align: 32, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "bHasMask", scope: !210, file: !1, line: 113, baseType: !215, size: 128, align: 32, offset: 384)
!226 = !DIGlobalVariable(name: "g_LayerTexture", linkageName: "\01?g_LayerTexture@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 129, type: !227, isLocal: false, isDefinition: true, variable: [13 x %"class.Texture2D<vector<float, 4> >"]* @"\01?g_LayerTexture@@3PAV?$Texture2D@V?$vector@M$03@@@@A")
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 2080, align: 32, elements: !229)
!228 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 129, size: 160, align: 32, elements: !2, templateParams: !145)
!229 = !{!230}
!230 = !DISubrange(count: 13)
!231 = !DIGlobalVariable(name: "g_Sampler", linkageName: "\01?g_Sampler@@3USamplerState@@A", scope: !0, file: !1, line: 131, type: !232, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?g_Sampler@@3USamplerState@@A")
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 131, size: 32, align: 32, elements: !2)
!233 = !DIGlobalVariable(name: "l_Material", linkageName: "\01?l_Material@@3U?$ConstantBuffer@UHasMaterial@@@@A", scope: !0, file: !1, line: 135, type: !234, isLocal: false, isDefinition: true)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<HasMaterial>", file: !1, line: 135, size: 32, align: 32, elements: !2, templateParams: !235)
!235 = !{!236}
!236 = !DITemplateTypeParameter(name: "T", type: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "HasMaterial", file: !1, line: 47, size: 1024, align: 32, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "bHasAlbedoColor", scope: !237, file: !1, line: 49, baseType: !20, size: 32, align: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "bHasEmissiveColor", scope: !237, file: !1, line: 50, baseType: !20, size: 32, align: 32, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSpecularColor", scope: !237, file: !1, line: 51, baseType: !20, size: 32, align: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "bHasGlossiness", scope: !237, file: !1, line: 52, baseType: !20, size: 32, align: 32, offset: 96)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSmoothness", scope: !237, file: !1, line: 53, baseType: !20, size: 32, align: 32, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "bHasMetallic", scope: !237, file: !1, line: 54, baseType: !20, size: 32, align: 32, offset: 160)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSpecularHighlight", scope: !237, file: !1, line: 55, baseType: !20, size: 32, align: 32, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "bHasGlossyReflection", scope: !237, file: !1, line: 56, baseType: !20, size: 32, align: 32, offset: 224)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "bHasAlbedoMap", scope: !237, file: !1, line: 58, baseType: !20, size: 32, align: 32, offset: 256)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSpecularMap", scope: !237, file: !1, line: 59, baseType: !20, size: 32, align: 32, offset: 288)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "bHasNormalMap", scope: !237, file: !1, line: 60, baseType: !20, size: 32, align: 32, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "bHasMetallicMap", scope: !237, file: !1, line: 61, baseType: !20, size: 32, align: 32, offset: 352)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bHasEmissionMap", scope: !237, file: !1, line: 62, baseType: !20, size: 32, align: 32, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "bHasDetailAlbedoMap", scope: !237, file: !1, line: 63, baseType: !20, size: 32, align: 32, offset: 416)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "bHasDetailNormalMap", scope: !237, file: !1, line: 64, baseType: !20, size: 32, align: 32, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Glossiness", scope: !237, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 480)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "AlbedoColor", scope: !237, file: !1, line: 67, baseType: !22, size: 128, align: 32, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "EmissiveColor", scope: !237, file: !1, line: 68, baseType: !22, size: 128, align: 32, offset: 640)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "SpecularColor", scope: !237, file: !1, line: 69, baseType: !22, size: 128, align: 32, offset: 768)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Smoothness", scope: !237, file: !1, line: 70, baseType: !8, size: 32, align: 32, offset: 896)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !237, file: !1, line: 71, baseType: !8, size: 32, align: 32, offset: 928)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "SpecularHighlight", scope: !237, file: !1, line: 72, baseType: !8, size: 32, align: 32, offset: 960)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "GlossyReflection", scope: !237, file: !1, line: 73, baseType: !8, size: 32, align: 32, offset: 992)
!262 = !DIGlobalVariable(name: "l_Mesh", linkageName: "\01?l_Mesh@@3U?$ConstantBuffer@UHasMesh@@@@A", scope: !0, file: !1, line: 136, type: !263, isLocal: false, isDefinition: true)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<HasMesh>", file: !1, line: 136, size: 32, align: 32, elements: !2, templateParams: !264)
!264 = !{!265}
!265 = !DITemplateTypeParameter(name: "T", type: !266)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "HasMesh", file: !1, line: 76, size: 256, align: 32, elements: !267)
!267 = !{!268, !269, !270, !271, !272, !273, !274, !275}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "bHasVertex", scope: !266, file: !1, line: 78, baseType: !20, size: 32, align: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "bHasColor", scope: !266, file: !1, line: 79, baseType: !20, size: 32, align: 32, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "bHasTex0", scope: !266, file: !1, line: 80, baseType: !20, size: 32, align: 32, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "bHasTex1", scope: !266, file: !1, line: 81, baseType: !20, size: 32, align: 32, offset: 96)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "bHasNormals", scope: !266, file: !1, line: 82, baseType: !20, size: 32, align: 32, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "bHasTangenrs", scope: !266, file: !1, line: 83, baseType: !20, size: 32, align: 32, offset: 160)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "bHasBiTangents", scope: !266, file: !1, line: 84, baseType: !20, size: 32, align: 32, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSubMeshes", scope: !266, file: !1, line: 85, baseType: !20, size: 32, align: 32, offset: 224)
!276 = !DIGlobalVariable(name: "l_Vertices", linkageName: "\01?l_Vertices@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 138, type: !277, isLocal: false, isDefinition: true)
!277 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 3> >", file: !1, line: 138, size: 96, align: 32, elements: !2, templateParams: !278)
!278 = !{!279}
!279 = !DITemplateTypeParameter(name: "element", type: !32)
!280 = !DIGlobalVariable(name: "l_Colors", linkageName: "\01?l_Colors@@3V?$StructuredBuffer@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 139, type: !281, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<vector<float, 4> >"* @"\01?l_Colors@@3V?$StructuredBuffer@V?$vector@M$03@@@@A")
!281 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 4> >", file: !1, line: 139, size: 128, align: 32, elements: !2, templateParams: !145)
!282 = !DIGlobalVariable(name: "l_Tex0", linkageName: "\01?l_Tex0@@3V?$StructuredBuffer@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 140, type: !283, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<vector<float, 2> >"* @"\01?l_Tex0@@3V?$StructuredBuffer@V?$vector@M$01@@@@A")
!283 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 2> >", file: !1, line: 140, size: 64, align: 32, elements: !2, templateParams: !284)
!284 = !{!285}
!285 = !DITemplateTypeParameter(name: "element", type: !40)
!286 = !DIGlobalVariable(name: "l_Tex1", linkageName: "\01?l_Tex1@@3V?$StructuredBuffer@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 141, type: !283, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<vector<float, 2> >"* @"\01?l_Tex1@@3V?$StructuredBuffer@V?$vector@M$01@@@@A")
!287 = !DIGlobalVariable(name: "l_Normals", linkageName: "\01?l_Normals@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 142, type: !277, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<vector<float, 3> >"* @"\01?l_Normals@@3V?$StructuredBuffer@V?$vector@M$02@@@@A")
!288 = !DIGlobalVariable(name: "l_Tangents", linkageName: "\01?l_Tangents@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 143, type: !277, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<vector<float, 3> >"* @"\01?l_Tangents@@3V?$StructuredBuffer@V?$vector@M$02@@@@A")
!289 = !DIGlobalVariable(name: "l_BiTangents", linkageName: "\01?l_BiTangents@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 144, type: !277, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<vector<float, 3> >"* @"\01?l_BiTangents@@3V?$StructuredBuffer@V?$vector@M$02@@@@A")
!290 = !DIGlobalVariable(name: "l_Indices", linkageName: "\01?l_Indices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 145, type: !291, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<unsigned int>"* @"\01?l_Indices@@3V?$StructuredBuffer@I@@A")
!291 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 145, size: 32, align: 32, elements: !2, templateParams: !292)
!292 = !{!293}
!293 = !DITemplateTypeParameter(name: "element", type: !55)
!294 = !DIGlobalVariable(name: "l_AlbedoMap", linkageName: "\01?l_AlbedoMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 147, type: !228, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?l_AlbedoMap@@3V?$Texture2D@V?$vector@M$03@@@@A")
!295 = !DIGlobalVariable(name: "l_SpecularMap", linkageName: "\01?l_SpecularMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 148, type: !228, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?l_SpecularMap@@3V?$Texture2D@V?$vector@M$03@@@@A")
