#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: ee5074186aba02e7e23f595a71b41f0e.pdb
; shader hash: ee5074186aba02e7e23f595a71b41f0e
;
; Buffer Definitions:
;
; cbuffer g_CameraInfo
; {
;
;   struct hostlayout.g_CameraInfo
;   {
;
;       struct hostlayout.struct.CameraInfo
;       {
;
;           column_major float4x4 mtxViewProj;        ; Offset:    0
;           column_major float4x4 mtxInverseViewProj; ; Offset:   64
;           float3 cameraEye;                         ; Offset:  128
;           float fElapsedTime;                       ; Offset:  140
;           int bNormalMapping;                       ; Offset:  144
;           int bReflection;                          ; Offset:  148
;           int nMapNumber;                           ; Offset:  152
;       
;       } g_CameraInfo;                               ; Offset:    0
;
;   
;   } g_CameraInfo;                                   ; Offset:    0 Size:   156
;
; }
;
; cbuffer g_Lights
; {
;
;   struct g_Lights
;   {
;
;       struct struct.Lights
;       {
;
;           uint numLights;                           ; Offset:    0
;           float3 padding;                           ; Offset:    4
;           struct struct.Light
;           {
;
;               uint Type;                            ; Offset:   16
;               float3 Position;                      ; Offset:   20
;               float Intensity;                      ; Offset:   32

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.7.2308.16 (52da17e29)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !138)
!1 = !DIFile(filename: "PBR_RayTracing.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !22, !31, !39}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 259, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 259, size: 288, align: 32, elements: !6, templateParams: !17)
!6 = !{!7, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !5, file: !1, line: 259, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !5, file: !1, line: 259, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !5, file: !1, line: 259, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !5, file: !1, line: 259, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !5, file: !1, line: 259, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !5, file: !1, line: 259, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !5, file: !1, line: 259, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !5, file: !1, line: 259, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !5, file: !1, line: 259, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!17 = !{!18, !19, !21}
!18 = !DITemplateTypeParameter(name: "element", type: !8)
!19 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 3)
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 262, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 262, size: 128, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !26, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 262, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 262, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 262, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, line: 262, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !{!18, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 4)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 187, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 187, size: 96, align: 32, elements: !33, templateParams: !37)
!33 = !{!34, !35, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !32, file: !1, line: 187, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !32, file: !1, line: 187, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !32, file: !1, line: 187, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!37 = !{!18, !38}
!38 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 3)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !41, templateParams: !44)
!41 = !{!42, !43}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !40, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !40, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !{!18, !45}
!45 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 2)
!46 = !{!47, !56, !57, !62, !63, !64, !67, !70, !73, !82, !86, !94, !97, !100, !103, !110, !116, !117, !118, !121, !124, !129, !132, !135}
!47 = !DISubprogram(name: "GetTex0FromBuffer", linkageName: "\01?GetTex0FromBuffer@@YAXY02$$CAV?$vector@M$01@@I@Z", scope: !1, file: !1, line: 155, type: !48, isLocal: false, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped, isOptimized: false)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !50, !54}
!50 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !51)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 192, align: 32, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 3)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !55)
!55 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!56 = !DISubprogram(name: "GetTex1FromBuffer", linkageName: "\01?GetTex1FromBuffer@@YAXY02$$CAV?$vector@M$01@@I@Z", scope: !1, file: !1, line: 172, type: !48, isLocal: false, isDefinition: true, scopeLine: 173, flags: DIFlagPrototyped, isOptimized: false)
!57 = !DISubprogram(name: "GetNormalFromBuffer", linkageName: "\01?GetNormalFromBuffer@@YAXY02$$CAV?$vector@M$02@@I@Z", scope: !1, file: !1, line: 189, type: !58, isLocal: false, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: false)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !60, !54}
!60 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 288, align: 32, elements: !52)
!62 = !DISubprogram(name: "GetTangentFromBuffer", linkageName: "\01?GetTangentFromBuffer@@YAXY02$$CAV?$vector@M$02@@I@Z", scope: !1, file: !1, line: 206, type: !58, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: false)
!63 = !DISubprogram(name: "GetBiTangentFromBuffer", linkageName: "\01?GetBiTangentFromBuffer@@YAXY02$$CAV?$vector@M$02@@I@Z", scope: !1, file: !1, line: 223, type: !58, isLocal: false, isDefinition: true, scopeLine: 224, flags: DIFlagPrototyped, isOptimized: false)
!64 = !DISubprogram(name: "GetInterpolationHitFloat2", linkageName: "\01?GetInterpolationHitFloat2@@YA?AV?$vector@M$01@@Y02V1@V1@@Z", scope: !1, file: !1, line: 245, type: !65, isLocal: false, isDefinition: true, scopeLine: 246, flags: DIFlagPrototyped, isOptimized: false)
!65 = !DISubroutineType(types: !66)
!66 = !{!39, !51, !39}
!67 = !DISubprogram(name: "GetInterpolationHitFloat3", linkageName: "\01?GetInterpolationHitFloat3@@YA?AV?$vector@M$02@@Y02V1@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 251, type: !68, isLocal: false, isDefinition: true, scopeLine: 252, flags: DIFlagPrototyped, isOptimized: false)
!68 = !DISubroutineType(types: !69)
!69 = !{!31, !61, !39}
!70 = !DISubprogram(name: "GetHitNormalFromNormalMap", linkageName: "\01?GetHitNormalFromNormalMap@@YA?AV?$vector@M$02@@V1@00V?$vector@M$01@@@Z", scope: !1, file: !1, line: 257, type: !71, isLocal: false, isDefinition: true, scopeLine: 258, flags: DIFlagPrototyped, isOptimized: false)
!71 = !DISubroutineType(types: !72)
!72 = !{!31, !31, !31, !31, !39}
!73 = !DISubprogram(name: "TraceRadianceRay", linkageName: "\01?TraceRadianceRay@@YA?AV?$vector@M$03@@URayDesc@@I@Z", scope: !1, file: !1, line: 264, type: !74, isLocal: false, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: false)
!74 = !DISubroutineType(types: !75)
!75 = !{!22, !76, !54}
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 262, size: 256, align: 32, elements: !77)
!77 = !{!78, !79, !80, !81}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !76, file: !1, line: 262, baseType: !32, size: 96, align: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !76, file: !1, line: 262, baseType: !8, size: 32, align: 32, offset: 96)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !76, file: !1, line: 262, baseType: !32, size: 96, align: 32, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !76, file: !1, line: 262, baseType: !8, size: 32, align: 32, offset: 224)
!82 = !DISubprogram(name: "CheckTheShadow", linkageName: "\01?CheckTheShadow@@YA_NURayDesc@@I@Z", scope: !1, file: !1, line: 305, type: !83, isLocal: false, isDefinition: true, scopeLine: 306, flags: DIFlagPrototyped, isOptimized: false)
!83 = !DISubroutineType(types: !84)
!84 = !{!85, !76, !54}
!85 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!86 = !DISubprogram(name: "CalculateLighting", linkageName: "\01?CalculateLighting@@YA?AV?$vector@M$02@@URadiancePayload@@V1@M11@Z", scope: !1, file: !1, line: 343, type: !87, isLocal: false, isDefinition: true, scopeLine: 344, flags: DIFlagPrototyped, isOptimized: false)
!87 = !DISubroutineType(types: !88)
!88 = !{!31, !89, !31, !8, !31, !31}
!89 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !90)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "RadiancePayload", file: !1, line: 23, size: 160, align: 32, elements: !91)
!91 = !{!92, !93}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "RayColor", scope: !90, file: !1, line: 25, baseType: !22, size: 128, align: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "RayDepth", scope: !90, file: !1, line: 26, baseType: !54, size: 32, align: 32, offset: 128)
!94 = !DISubprogram(name: "CalculateFinalColor", linkageName: "\01?CalculateFinalColor@@YA?AV?$vector@M$03@@URadiancePayload@@V?$vector@M$02@@V1@IV?$vector@M$01@@3@Z", scope: !1, file: !1, line: 549, type: !95, isLocal: false, isDefinition: true, scopeLine: 550, flags: DIFlagPrototyped, isOptimized: false)
!95 = !DISubroutineType(types: !96)
!96 = !{!22, !89, !31, !22, !54, !39, !39}
!97 = !DISubprogram(name: "RayGenShader", linkageName: "\01?RayGenShader@@YAXXZ", scope: !1, file: !1, line: 651, type: !98, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGenShader@@YAXXZ")
!98 = !DISubroutineType(types: !99)
!99 = !{null}
!100 = !DISubprogram(name: "RadianceMiss", linkageName: "\01?RadianceMiss@@YAXURadiancePayload@@@Z", scope: !1, file: !1, line: 672, type: !101, isLocal: false, isDefinition: true, scopeLine: 673, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RadiancePayload*)* @"\01?RadianceMiss@@YAXURadiancePayload@@@Z")
!101 = !DISubroutineType(types: !102)
!102 = !{null, !89}
!103 = !DISubprogram(name: "ShadowMiss", linkageName: "\01?ShadowMiss@@YAXUShadowPayload@@@Z", scope: !1, file: !1, line: 686, type: !104, isLocal: false, isDefinition: true, scopeLine: 687, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.ShadowPayload*)* @"\01?ShadowMiss@@YAXUShadowPayload@@@Z")
!104 = !DISubroutineType(types: !105)
!105 = !{null, !106}
!106 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !107)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "ShadowPayload", file: !1, line: 29, size: 32, align: 32, elements: !108)
!108 = !{!109}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "bShadow", scope: !107, file: !1, line: 31, baseType: !85, size: 32, align: 32)
!110 = !DISubprogram(name: "RadianceAnyHit", linkageName: "\01?RadianceAnyHit@@YAXURadiancePayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 692, type: !111, isLocal: false, isDefinition: true, scopeLine: 693, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RadiancePayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?RadianceAnyHit@@YAXURadiancePayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!111 = !DISubroutineType(types: !112)
!112 = !{null, !89, !113}
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 689, size: 64, align: 32, elements: !114)
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !113, file: !1, line: 689, baseType: !40, size: 64, align: 32)
!116 = !DISubprogram(name: "ShadowAnyHit", linkageName: "\01?ShadowAnyHit@@YAXURadiancePayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 719, type: !111, isLocal: false, isDefinition: true, scopeLine: 720, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RadiancePayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ShadowAnyHit@@YAXURadiancePayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!117 = !DISubprogram(name: "RadianceClosestHit", linkageName: "\01?RadianceClosestHit@@YAXURadiancePayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 762, type: !111, isLocal: false, isDefinition: true, scopeLine: 763, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RadiancePayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?RadianceClosestHit@@YAXURadiancePayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!118 = !DISubprogram(name: "ShadowClosestHit", linkageName: "\01?ShadowClosestHit@@YAXUShadowPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 857, type: !119, isLocal: false, isDefinition: true, scopeLine: 858, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.ShadowPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ShadowClosestHit@@YAXUShadowPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!119 = !DISubroutineType(types: !120)
!120 = !{null, !106, !113}
!121 = !DISubprogram(name: "GetWorldPosition", linkageName: "\01?GetWorldPosition@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 240, type: !122, isLocal: false, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: false)
!122 = !DISubroutineType(types: !123)
!123 = !{!31}
!124 = !DISubprogram(name: "CalculateCookTorranceSpecular", linkageName: "\01?CalculateCookTorranceSpecular@@YA?AV?$vector@M$02@@AIAV1@MV1@MMM@Z", scope: !1, file: !1, line: 324, type: !125, isLocal: false, isDefinition: true, scopeLine: 325, flags: DIFlagPrototyped, isOptimized: false)
!125 = !DISubroutineType(types: !126)
!126 = !{!31, !127, !8, !31, !8, !8, !8}
!127 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !31)
!129 = !DISubprogram(name: "GetFresnelusingSchlick", linkageName: "\01?GetFresnelusingSchlick@@YA?AV?$vector@M$02@@V1@M@Z", scope: !1, file: !1, line: 284, type: !130, isLocal: false, isDefinition: true, scopeLine: 285, flags: DIFlagPrototyped, isOptimized: false)
!130 = !DISubroutineType(types: !131)
!131 = !{!31, !31, !8}
!132 = !DISubprogram(name: "D_GGX", linkageName: "\01?D_GGX@@YAMMM@Z", scope: !1, file: !1, line: 289, type: !133, isLocal: false, isDefinition: true, scopeLine: 290, flags: DIFlagPrototyped, isOptimized: false)
!133 = !DISubroutineType(types: !134)
!134 = !{!8, !8, !8}
!135 = !DISubprogram(name: "GetSmithGeometry", linkageName: "\01?GetSmithGeometry@@YA?AV?$vector@M$02@@MMM@Z", scope: !1, file: !1, line: 296, type: !136, isLocal: false, isDefinition: true, scopeLine: 297, flags: DIFlagPrototyped, isOptimized: false)
!136 = !DISubroutineType(types: !137)
!137 = !{!31, !8, !8, !8}
!138 = !{!139, !141, !143, !147, !181, !203, !205, !225, !230, !232, !261, !275, !279, !281, !285, !286, !287, !288, !289, !293, !294, !295, !296, !297, !298, !299, !300}
!139 = !DIGlobalVariable(name: "RAY_FLAG_NONE", scope: !0, file: !1, line: 273, type: !140, isLocal: true, isDefinition: true, variable: i32 0)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!141 = !DIGlobalVariable(name: "g_Scene", linkageName: "\01?g_Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 118, type: !142, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?g_Scene@@3URaytracingAccelerationStructure@@A")
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 118, size: 32, align: 32, elements: !2)
!143 = !DIGlobalVariable(name: "uav", linkageName: "\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 120, type: !144, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!144 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 120, size: 128, align: 32, elements: !2, templateParams: !145)
!145 = !{!146}
!146 = !DITemplateTypeParameter(name: "element", type: !23)
!147 = !DIGlobalVariable(name: "g_CameraInfo", linkageName: "\01?g_CameraInfo@@3U?$ConstantBuffer@UCameraInfo@@@@A", scope: !0, file: !1, line: 122, type: !148, isLocal: false, isDefinition: true)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<CameraInfo>", file: !1, line: 122, size: 32, align: 32, elements: !2, templateParams: !149)
!149 = !{!150}
!150 = !DITemplateTypeParameter(name: "T", type: !151)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "CameraInfo", file: !1, line: 34, size: 1248, align: 32, elements: !152)
!152 = !{!153, !175, !176, !177, !178, !179, !180}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "mtxViewProj", scope: !151, file: !1, line: 36, baseType: !154, size: 512, align: 32)
!154 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 122, size: 512, align: 32, elements: !155, templateParams: !172)
!155 = !{!156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !154, file: !1, line: 122, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !154, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !154, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !154, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !154, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !154, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !154, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !154, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !154, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !154, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !154, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !154, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !154, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !154, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !154, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !154, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!172 = !{!18, !173, !174}
!173 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 4)
!174 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 4)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "mtxInverseViewProj", scope: !151, file: !1, line: 37, baseType: !154, size: 512, align: 32, offset: 512)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "cameraEye", scope: !151, file: !1, line: 38, baseType: !31, size: 96, align: 32, offset: 1024)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "fElapsedTime", scope: !151, file: !1, line: 39, baseType: !8, size: 32, align: 32, offset: 1120)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "bNormalMapping", scope: !151, file: !1, line: 40, baseType: !20, size: 32, align: 32, offset: 1152)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "bReflection", scope: !151, file: !1, line: 41, baseType: !20, size: 32, align: 32, offset: 1184)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nMapNumber", scope: !151, file: !1, line: 42, baseType: !20, size: 32, align: 32, offset: 1216)
!181 = !DIGlobalVariable(name: "g_Lights", linkageName: "\01?g_Lights@@3U?$ConstantBuffer@ULights@@@@A", scope: !0, file: !1, line: 123, type: !182, isLocal: false, isDefinition: true)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<Lights>", file: !1, line: 123, size: 32, align: 32, elements: !2, templateParams: !183)
!183 = !{!184}
!184 = !DITemplateTypeParameter(name: "T", type: !185)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lights", file: !1, line: 99, size: 32896, align: 32, elements: !186)
!186 = !{!187, !188, !189}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "numLights", scope: !185, file: !1, line: 101, baseType: !54, size: 32, align: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !185, file: !1, line: 102, baseType: !31, size: 96, align: 32, offset: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "lights", scope: !185, file: !1, line: 103, baseType: !190, size: 32768, align: 32, offset: 128)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 32768, align: 32, elements: !201)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light", file: !1, line: 87, size: 512, align: 32, elements: !192)
!192 = !{!193, !194, !195, !196, !197, !198, !199, !200}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !191, file: !1, line: 89, baseType: !54, size: 32, align: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !191, file: !1, line: 90, baseType: !31, size: 96, align: 32, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Intensity", scope: !191, file: !1, line: 91, baseType: !8, size: 32, align: 32, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !191, file: !1, line: 92, baseType: !31, size: 96, align: 32, offset: 160)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Range", scope: !191, file: !1, line: 93, baseType: !8, size: 32, align: 32, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "SpotAngle", scope: !191, file: !1, line: 94, baseType: !8, size: 32, align: 32, offset: 288)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !191, file: !1, line: 95, baseType: !39, size: 64, align: 32, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !191, file: !1, line: 96, baseType: !22, size: 128, align: 32, offset: 384)
!201 = !{!202}
!202 = !DISubrange(count: 64)
!203 = !DIGlobalVariable(name: "g_EnviormentTexure", linkageName: "\01?g_EnviormentTexure@@3V?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 125, type: !204, isLocal: false, isDefinition: true, variable: %"class.TextureCube<vector<float, 4> >"* @"\01?g_EnviormentTexure@@3V?$TextureCube@V?$vector@M$03@@@@A")
!204 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 125, size: 128, align: 32, elements: !2, templateParams: !145)
!205 = !DIGlobalVariable(name: "g_TerrainInfo", linkageName: "\01?g_TerrainInfo@@3U?$ConstantBuffer@UTerrainCBV@@@@A", scope: !0, file: !1, line: 127, type: !206, isLocal: false, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<TerrainCBV>", file: !1, line: 127, size: 32, align: 32, elements: !2, templateParams: !207)
!207 = !{!208}
!208 = !DITemplateTypeParameter(name: "T", type: !209)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "TerrainCBV", file: !1, line: 106, size: 512, align: 32, elements: !210)
!210 = !{!211, !212, !213, !223, !224}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "numLayer", scope: !209, file: !1, line: 108, baseType: !54, size: 32, align: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !209, file: !1, line: 109, baseType: !31, size: 96, align: 32, offset: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "bHasDiffuse", scope: !209, file: !1, line: 110, baseType: !214, size: 128, align: 32, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "int4", file: !1, line: 127, baseType: !215)
!215 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 4>", file: !1, line: 127, size: 128, align: 32, elements: !216, templateParams: !221)
!216 = !{!217, !218, !219, !220}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !215, file: !1, line: 127, baseType: !20, size: 32, align: 32, flags: DIFlagPublic)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !215, file: !1, line: 127, baseType: !20, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !215, file: !1, line: 127, baseType: !20, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !215, file: !1, line: 127, baseType: !20, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!221 = !{!222, !30}
!222 = !DITemplateTypeParameter(name: "element", type: !20)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "bHasNormal", scope: !209, file: !1, line: 111, baseType: !214, size: 128, align: 32, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "bHasMask", scope: !209, file: !1, line: 112, baseType: !214, size: 128, align: 32, offset: 384)
!225 = !DIGlobalVariable(name: "g_LayerTexture", linkageName: "\01?g_LayerTexture@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 128, type: !226, isLocal: false, isDefinition: true, variable: [13 x %"class.Texture2D<vector<float, 4> >"]* @"\01?g_LayerTexture@@3PAV?$Texture2D@V?$vector@M$03@@@@A")
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, size: 2080, align: 32, elements: !228)
!227 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 128, size: 160, align: 32, elements: !2, templateParams: !145)
!228 = !{!229}
!229 = !DISubrange(count: 13)
!230 = !DIGlobalVariable(name: "g_Sampler", linkageName: "\01?g_Sampler@@3USamplerState@@A", scope: !0, file: !1, line: 130, type: !231, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?g_Sampler@@3USamplerState@@A")
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 130, size: 32, align: 32, elements: !2)
!232 = !DIGlobalVariable(name: "l_Material", linkageName: "\01?l_Material@@3U?$ConstantBuffer@UHasMaterial@@@@A", scope: !0, file: !1, line: 134, type: !233, isLocal: false, isDefinition: true)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<HasMaterial>", file: !1, line: 134, size: 32, align: 32, elements: !2, templateParams: !234)
!234 = !{!235}
!235 = !DITemplateTypeParameter(name: "T", type: !236)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "HasMaterial", file: !1, line: 46, size: 1024, align: 32, elements: !237)
!237 = !{!238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "bHasAlbedoColor", scope: !236, file: !1, line: 48, baseType: !20, size: 32, align: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "bHasEmissiveColor", scope: !236, file: !1, line: 49, baseType: !20, size: 32, align: 32, offset: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSpecularColor", scope: !236, file: !1, line: 50, baseType: !20, size: 32, align: 32, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "bHasGlossiness", scope: !236, file: !1, line: 51, baseType: !20, size: 32, align: 32, offset: 96)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSmoothness", scope: !236, file: !1, line: 52, baseType: !20, size: 32, align: 32, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "bHasMetallic", scope: !236, file: !1, line: 53, baseType: !20, size: 32, align: 32, offset: 160)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSpecularHighlight", scope: !236, file: !1, line: 54, baseType: !20, size: 32, align: 32, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "bHasGlossyReflection", scope: !236, file: !1, line: 55, baseType: !20, size: 32, align: 32, offset: 224)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "bHasAlbedoMap", scope: !236, file: !1, line: 57, baseType: !20, size: 32, align: 32, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSpecularMap", scope: !236, file: !1, line: 58, baseType: !20, size: 32, align: 32, offset: 288)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "bHasNormalMap", scope: !236, file: !1, line: 59, baseType: !20, size: 32, align: 32, offset: 320)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "bHasMetallicMap", scope: !236, file: !1, line: 60, baseType: !20, size: 32, align: 32, offset: 352)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "bHasEmissionMap", scope: !236, file: !1, line: 61, baseType: !20, size: 32, align: 32, offset: 384)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bHasDetailAlbedoMap", scope: !236, file: !1, line: 62, baseType: !20, size: 32, align: 32, offset: 416)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "bHasDetailNormalMap", scope: !236, file: !1, line: 63, baseType: !20, size: 32, align: 32, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Glossiness", scope: !236, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 480)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "AlbedoColor", scope: !236, file: !1, line: 66, baseType: !22, size: 128, align: 32, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "EmissiveColor", scope: !236, file: !1, line: 67, baseType: !22, size: 128, align: 32, offset: 640)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "SpecularColor", scope: !236, file: !1, line: 68, baseType: !22, size: 128, align: 32, offset: 768)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Smoothness", scope: !236, file: !1, line: 69, baseType: !8, size: 32, align: 32, offset: 896)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !236, file: !1, line: 70, baseType: !8, size: 32, align: 32, offset: 928)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "SpecularHighlight", scope: !236, file: !1, line: 71, baseType: !8, size: 32, align: 32, offset: 960)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "GlossyReflection", scope: !236, file: !1, line: 72, baseType: !8, size: 32, align: 32, offset: 992)
!261 = !DIGlobalVariable(name: "l_Mesh", linkageName: "\01?l_Mesh@@3U?$ConstantBuffer@UHasMesh@@@@A", scope: !0, file: !1, line: 135, type: !262, isLocal: false, isDefinition: true)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<HasMesh>", file: !1, line: 135, size: 32, align: 32, elements: !2, templateParams: !263)
!263 = !{!264}
!264 = !DITemplateTypeParameter(name: "T", type: !265)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "HasMesh", file: !1, line: 75, size: 256, align: 32, elements: !266)
!266 = !{!267, !268, !269, !270, !271, !272, !273, !274}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "bHasVertex", scope: !265, file: !1, line: 77, baseType: !20, size: 32, align: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "bHasColor", scope: !265, file: !1, line: 78, baseType: !20, size: 32, align: 32, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "bHasTex0", scope: !265, file: !1, line: 79, baseType: !20, size: 32, align: 32, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "bHasTex1", scope: !265, file: !1, line: 80, baseType: !20, size: 32, align: 32, offset: 96)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "bHasNormals", scope: !265, file: !1, line: 81, baseType: !20, size: 32, align: 32, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "bHasTangenrs", scope: !265, file: !1, line: 82, baseType: !20, size: 32, align: 32, offset: 160)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "bHasBiTangents", scope: !265, file: !1, line: 83, baseType: !20, size: 32, align: 32, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSubMeshes", scope: !265, file: !1, line: 84, baseType: !20, size: 32, align: 32, offset: 224)
!275 = !DIGlobalVariable(name: "l_Vertices", linkageName: "\01?l_Vertices@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 137, type: !276, isLocal: false, isDefinition: true)
!276 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 3> >", file: !1, line: 137, size: 96, align: 32, elements: !2, templateParams: !277)
!277 = !{!278}
!278 = !DITemplateTypeParameter(name: "element", type: !32)
!279 = !DIGlobalVariable(name: "l_Colors", linkageName: "\01?l_Colors@@3V?$StructuredBuffer@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 138, type: !280, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<vector<float, 4> >"* @"\01?l_Colors@@3V?$StructuredBuffer@V?$vector@M$03@@@@A")
!280 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 4> >", file: !1, line: 138, size: 128, align: 32, elements: !2, templateParams: !145)
!281 = !DIGlobalVariable(name: "l_Tex0", linkageName: "\01?l_Tex0@@3V?$StructuredBuffer@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 139, type: !282, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<vector<float, 2> >"* @"\01?l_Tex0@@3V?$StructuredBuffer@V?$vector@M$01@@@@A")
!282 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 2> >", file: !1, line: 139, size: 64, align: 32, elements: !2, templateParams: !283)
!283 = !{!284}
!284 = !DITemplateTypeParameter(name: "element", type: !40)
!285 = !DIGlobalVariable(name: "l_Tex1", linkageName: "\01?l_Tex1@@3V?$StructuredBuffer@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 140, type: !282, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<vector<float, 2> >"* @"\01?l_Tex1@@3V?$StructuredBuffer@V?$vector@M$01@@@@A")
!286 = !DIGlobalVariable(name: "l_Normals", linkageName: "\01?l_Normals@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 141, type: !276, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<vector<float, 3> >"* @"\01?l_Normals@@3V?$StructuredBuffer@V?$vector@M$02@@@@A")
!287 = !DIGlobalVariable(name: "l_Tangents", linkageName: "\01?l_Tangents@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 142, type: !276, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<vector<float, 3> >"* @"\01?l_Tangents@@3V?$StructuredBuffer@V?$vector@M$02@@@@A")
!288 = !DIGlobalVariable(name: "l_BiTangents", linkageName: "\01?l_BiTangents@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 143, type: !276, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<vector<float, 3> >"* @"\01?l_BiTangents@@3V?$StructuredBuffer@V?$vector@M$02@@@@A")
!289 = !DIGlobalVariable(name: "l_Indices", linkageName: "\01?l_Indices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 144, type: !290, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<unsigned int>"* @"\01?l_Indices@@3V?$StructuredBuffer@I@@A")
!290 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 144, size: 32, align: 32, elements: !2, templateParams: !291)
!291 = !{!292}
!292 = !DITemplateTypeParameter(name: "element", type: !55)
!293 = !DIGlobalVariable(name: "l_AlbedoMap", linkageName: "\01?l_AlbedoMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 146, type: !227, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?l_AlbedoMap@@3V?$Texture2D@V?$vector@M$03@@@@A")
!294 = !DIGlobalVariable(name: "l_SpecularMap", linkageName: "\01?l_SpecularMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 147, type: !227, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?l_SpecularMap@@3V?$Texture2D@V?$vector@M$03@@@@A")
