#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: d4d12b219f32b9d73e07541377a568f3.pdb
; shader hash: d4d12b219f32b9d73e07541377a568f3
;
; Buffer Definitions:
;
; cbuffer g_CameraInfo
; {
;
;   struct hostlayout.g_CameraInfo
;   {
;
;       struct hostlayout.struct.CameraInfo
;       {
;
;           column_major float4x4 mtxViewProj;        ; Offset:    0
;           column_major float4x4 mtxInverseViewProj; ; Offset:   64
;           float3 cameraEye;                         ; Offset:  128
;           int bNormalMapping;                       ; Offset:  140
;           int bReflection;                          ; Offset:  144
;       
;       } g_CameraInfo;                               ; Offset:    0
;
;   
;   } g_CameraInfo;                                   ; Offset:    0 Size:   148
;
; }
;
; cbuffer g_Lights
; {
;
;   struct g_Lights
;   {
;
;       struct struct.Lights
;       {
;
;           uint numLights;                           ; Offset:    0
;           float3 padding;                           ; Offset:    4
;           struct struct.Light
;           {
;
;               uint Type;                            ; Offset:   16
;               float3 Position;                      ; Offset:   20
;               float Intensity;                      ; Offset:   32
;               float3 Direction;                     ; Offset:   36
;               float Range;                          ; Offset:   48

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.7.2308.16 (52da17e29)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !138)
!1 = !DIFile(filename: "PBR_RayTracing.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !22, !31, !39}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 256, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 256, size: 288, align: 32, elements: !6, templateParams: !17)
!6 = !{!7, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !5, file: !1, line: 256, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !5, file: !1, line: 256, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !5, file: !1, line: 256, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !5, file: !1, line: 256, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !5, file: !1, line: 256, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !5, file: !1, line: 256, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !5, file: !1, line: 256, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !5, file: !1, line: 256, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !5, file: !1, line: 256, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!17 = !{!18, !19, !21}
!18 = !DITemplateTypeParameter(name: "element", type: !8)
!19 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 3)
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 259, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 259, size: 128, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !26, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 259, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 259, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 259, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, line: 259, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !{!18, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 4)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 184, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 184, size: 96, align: 32, elements: !33, templateParams: !37)
!33 = !{!34, !35, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !32, file: !1, line: 184, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !32, file: !1, line: 184, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !32, file: !1, line: 184, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!37 = !{!18, !38}
!38 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 3)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !41, templateParams: !44)
!41 = !{!42, !43}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !40, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !40, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !{!18, !45}
!45 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 2)
!46 = !{!47, !56, !57, !62, !63, !64, !67, !70, !73, !82, !86, !94, !97, !100, !103, !110, !116, !117, !118, !121, !124, !129, !132, !135}
!47 = !DISubprogram(name: "GetTex0FromBuffer", linkageName: "\01?GetTex0FromBuffer@@YAXY02$$CAV?$vector@M$01@@I@Z", scope: !1, file: !1, line: 152, type: !48, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: false)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !50, !54}
!50 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !51)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 192, align: 32, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 3)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !55)
!55 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!56 = !DISubprogram(name: "GetTex1FromBuffer", linkageName: "\01?GetTex1FromBuffer@@YAXY02$$CAV?$vector@M$01@@I@Z", scope: !1, file: !1, line: 169, type: !48, isLocal: false, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: false)
!57 = !DISubprogram(name: "GetNormalFromBuffer", linkageName: "\01?GetNormalFromBuffer@@YAXY02$$CAV?$vector@M$02@@I@Z", scope: !1, file: !1, line: 186, type: !58, isLocal: false, isDefinition: true, scopeLine: 187, flags: DIFlagPrototyped, isOptimized: false)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !60, !54}
!60 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 288, align: 32, elements: !52)
!62 = !DISubprogram(name: "GetTangentFromBuffer", linkageName: "\01?GetTangentFromBuffer@@YAXY02$$CAV?$vector@M$02@@I@Z", scope: !1, file: !1, line: 203, type: !58, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: false)
!63 = !DISubprogram(name: "GetBiTangentFromBuffer", linkageName: "\01?GetBiTangentFromBuffer@@YAXY02$$CAV?$vector@M$02@@I@Z", scope: !1, file: !1, line: 220, type: !58, isLocal: false, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped, isOptimized: false)
!64 = !DISubprogram(name: "GetInterpolationHitFloat2", linkageName: "\01?GetInterpolationHitFloat2@@YA?AV?$vector@M$01@@Y02V1@V1@@Z", scope: !1, file: !1, line: 242, type: !65, isLocal: false, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: false)
!65 = !DISubroutineType(types: !66)
!66 = !{!39, !51, !39}
!67 = !DISubprogram(name: "GetInterpolationHitFloat3", linkageName: "\01?GetInterpolationHitFloat3@@YA?AV?$vector@M$02@@Y02V1@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 248, type: !68, isLocal: false, isDefinition: true, scopeLine: 249, flags: DIFlagPrototyped, isOptimized: false)
!68 = !DISubroutineType(types: !69)
!69 = !{!31, !61, !39}
!70 = !DISubprogram(name: "GetHitNormalFromNormalMap", linkageName: "\01?GetHitNormalFromNormalMap@@YA?AV?$vector@M$02@@V1@00V?$vector@M$01@@@Z", scope: !1, file: !1, line: 254, type: !71, isLocal: false, isDefinition: true, scopeLine: 255, flags: DIFlagPrototyped, isOptimized: false)
!71 = !DISubroutineType(types: !72)
!72 = !{!31, !31, !31, !31, !39}
!73 = !DISubprogram(name: "TraceRadianceRay", linkageName: "\01?TraceRadianceRay@@YA?AV?$vector@M$03@@URayDesc@@I@Z", scope: !1, file: !1, line: 261, type: !74, isLocal: false, isDefinition: true, scopeLine: 262, flags: DIFlagPrototyped, isOptimized: false)
!74 = !DISubroutineType(types: !75)
!75 = !{!22, !76, !54}
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 259, size: 256, align: 32, elements: !77)
!77 = !{!78, !79, !80, !81}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !76, file: !1, line: 259, baseType: !32, size: 96, align: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !76, file: !1, line: 259, baseType: !8, size: 32, align: 32, offset: 96)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !76, file: !1, line: 259, baseType: !32, size: 96, align: 32, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !76, file: !1, line: 259, baseType: !8, size: 32, align: 32, offset: 224)
!82 = !DISubprogram(name: "CheckTheShadow", linkageName: "\01?CheckTheShadow@@YA_NURayDesc@@I@Z", scope: !1, file: !1, line: 302, type: !83, isLocal: false, isDefinition: true, scopeLine: 303, flags: DIFlagPrototyped, isOptimized: false)
!83 = !DISubroutineType(types: !84)
!84 = !{!85, !76, !54}
!85 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!86 = !DISubprogram(name: "CalculateLighting", linkageName: "\01?CalculateLighting@@YA?AV?$vector@M$02@@URadiancePayload@@V1@M11@Z", scope: !1, file: !1, line: 339, type: !87, isLocal: false, isDefinition: true, scopeLine: 340, flags: DIFlagPrototyped, isOptimized: false)
!87 = !DISubroutineType(types: !88)
!88 = !{!31, !89, !31, !8, !31, !31}
!89 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !90)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "RadiancePayload", file: !1, line: 22, size: 160, align: 32, elements: !91)
!91 = !{!92, !93}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "RayColor", scope: !90, file: !1, line: 24, baseType: !22, size: 128, align: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "RayDepth", scope: !90, file: !1, line: 25, baseType: !54, size: 32, align: 32, offset: 128)
!94 = !DISubprogram(name: "CalculateFinalColor", linkageName: "\01?CalculateFinalColor@@YA?AV?$vector@M$03@@URadiancePayload@@V?$vector@M$02@@V1@IV?$vector@M$01@@3@Z", scope: !1, file: !1, line: 511, type: !95, isLocal: false, isDefinition: true, scopeLine: 512, flags: DIFlagPrototyped, isOptimized: false)
!95 = !DISubroutineType(types: !96)
!96 = !{!22, !89, !31, !22, !54, !39, !39}
!97 = !DISubprogram(name: "RayGenShader", linkageName: "\01?RayGenShader@@YAXXZ", scope: !1, file: !1, line: 596, type: !98, isLocal: false, isDefinition: true, scopeLine: 597, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGenShader@@YAXXZ")
!98 = !DISubroutineType(types: !99)
!99 = !{null}
!100 = !DISubprogram(name: "RadianceMiss", linkageName: "\01?RadianceMiss@@YAXURadiancePayload@@@Z", scope: !1, file: !1, line: 617, type: !101, isLocal: false, isDefinition: true, scopeLine: 618, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RadiancePayload*)* @"\01?RadianceMiss@@YAXURadiancePayload@@@Z")
!101 = !DISubroutineType(types: !102)
!102 = !{null, !89}
!103 = !DISubprogram(name: "ShadowMiss", linkageName: "\01?ShadowMiss@@YAXUShadowPayload@@@Z", scope: !1, file: !1, line: 631, type: !104, isLocal: false, isDefinition: true, scopeLine: 632, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.ShadowPayload*)* @"\01?ShadowMiss@@YAXUShadowPayload@@@Z")
!104 = !DISubroutineType(types: !105)
!105 = !{null, !106}
!106 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !107)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "ShadowPayload", file: !1, line: 28, size: 32, align: 32, elements: !108)
!108 = !{!109}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "bShadow", scope: !107, file: !1, line: 30, baseType: !85, size: 32, align: 32)
!110 = !DISubprogram(name: "RadianceAnyHit", linkageName: "\01?RadianceAnyHit@@YAXURadiancePayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 637, type: !111, isLocal: false, isDefinition: true, scopeLine: 638, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RadiancePayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?RadianceAnyHit@@YAXURadiancePayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!111 = !DISubroutineType(types: !112)
!112 = !{null, !89, !113}
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 634, size: 64, align: 32, elements: !114)
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !113, file: !1, line: 634, baseType: !40, size: 64, align: 32)
!116 = !DISubprogram(name: "ShadowAnyHit", linkageName: "\01?ShadowAnyHit@@YAXURadiancePayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 664, type: !111, isLocal: false, isDefinition: true, scopeLine: 665, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RadiancePayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ShadowAnyHit@@YAXURadiancePayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!117 = !DISubprogram(name: "RadianceClosestHit", linkageName: "\01?RadianceClosestHit@@YAXURadiancePayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 707, type: !111, isLocal: false, isDefinition: true, scopeLine: 708, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RadiancePayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?RadianceClosestHit@@YAXURadiancePayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!118 = !DISubprogram(name: "ShadowClosestHit", linkageName: "\01?ShadowClosestHit@@YAXUShadowPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 790, type: !119, isLocal: false, isDefinition: true, scopeLine: 791, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.ShadowPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ShadowClosestHit@@YAXUShadowPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!119 = !DISubroutineType(types: !120)
!120 = !{null, !106, !113}
!121 = !DISubprogram(name: "GetWorldPosition", linkageName: "\01?GetWorldPosition@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 237, type: !122, isLocal: false, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: false)
!122 = !DISubroutineType(types: !123)
!123 = !{!31}
!124 = !DISubprogram(name: "CalculateCookTorranceSpecular", linkageName: "\01?CalculateCookTorranceSpecular@@YA?AV?$vector@M$02@@AIAV1@MV1@MMM@Z", scope: !1, file: !1, line: 320, type: !125, isLocal: false, isDefinition: true, scopeLine: 321, flags: DIFlagPrototyped, isOptimized: false)
!125 = !DISubroutineType(types: !126)
!126 = !{!31, !127, !8, !31, !8, !8, !8}
!127 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !31)
!129 = !DISubprogram(name: "GetFresnelusingSchlick", linkageName: "\01?GetFresnelusingSchlick@@YA?AV?$vector@M$02@@V1@M@Z", scope: !1, file: !1, line: 281, type: !130, isLocal: false, isDefinition: true, scopeLine: 282, flags: DIFlagPrototyped, isOptimized: false)
!130 = !DISubroutineType(types: !131)
!131 = !{!31, !31, !8}
!132 = !DISubprogram(name: "D_GGX", linkageName: "\01?D_GGX@@YAMMM@Z", scope: !1, file: !1, line: 286, type: !133, isLocal: false, isDefinition: true, scopeLine: 287, flags: DIFlagPrototyped, isOptimized: false)
!133 = !DISubroutineType(types: !134)
!134 = !{!8, !8, !8}
!135 = !DISubprogram(name: "GetSmithGeometry", linkageName: "\01?GetSmithGeometry@@YA?AV?$vector@M$02@@MMM@Z", scope: !1, file: !1, line: 293, type: !136, isLocal: false, isDefinition: true, scopeLine: 294, flags: DIFlagPrototyped, isOptimized: false)
!136 = !DISubroutineType(types: !137)
!137 = !{!31, !8, !8, !8}
!138 = !{!139, !141, !143, !147, !179, !201, !203, !223, !228, !230, !259, !273, !277, !279, !283, !284, !285, !286, !287, !291, !292, !293, !294, !295, !296, !297, !298}
!139 = !DIGlobalVariable(name: "RAY_FLAG_NONE", scope: !0, file: !1, line: 270, type: !140, isLocal: true, isDefinition: true, variable: i32 0)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!141 = !DIGlobalVariable(name: "g_Scene", linkageName: "\01?g_Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 115, type: !142, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?g_Scene@@3URaytracingAccelerationStructure@@A")
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 115, size: 32, align: 32, elements: !2)
!143 = !DIGlobalVariable(name: "uav", linkageName: "\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 117, type: !144, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!144 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 117, size: 128, align: 32, elements: !2, templateParams: !145)
!145 = !{!146}
!146 = !DITemplateTypeParameter(name: "element", type: !23)
!147 = !DIGlobalVariable(name: "g_CameraInfo", linkageName: "\01?g_CameraInfo@@3U?$ConstantBuffer@UCameraInfo@@@@A", scope: !0, file: !1, line: 119, type: !148, isLocal: false, isDefinition: true)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<CameraInfo>", file: !1, line: 119, size: 32, align: 32, elements: !2, templateParams: !149)
!149 = !{!150}
!150 = !DITemplateTypeParameter(name: "T", type: !151)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "CameraInfo", file: !1, line: 33, size: 1184, align: 32, elements: !152)
!152 = !{!153, !175, !176, !177, !178}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "mtxViewProj", scope: !151, file: !1, line: 35, baseType: !154, size: 512, align: 32)
!154 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 119, size: 512, align: 32, elements: !155, templateParams: !172)
!155 = !{!156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !154, file: !1, line: 119, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !154, file: !1, line: 119, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !154, file: !1, line: 119, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !154, file: !1, line: 119, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !154, file: !1, line: 119, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !154, file: !1, line: 119, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !154, file: !1, line: 119, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !154, file: !1, line: 119, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !154, file: !1, line: 119, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !154, file: !1, line: 119, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !154, file: !1, line: 119, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !154, file: !1, line: 119, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !154, file: !1, line: 119, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !154, file: !1, line: 119, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !154, file: !1, line: 119, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !154, file: !1, line: 119, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!172 = !{!18, !173, !174}
!173 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 4)
!174 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 4)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "mtxInverseViewProj", scope: !151, file: !1, line: 36, baseType: !154, size: 512, align: 32, offset: 512)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "cameraEye", scope: !151, file: !1, line: 37, baseType: !31, size: 96, align: 32, offset: 1024)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "bNormalMapping", scope: !151, file: !1, line: 38, baseType: !20, size: 32, align: 32, offset: 1120)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "bReflection", scope: !151, file: !1, line: 39, baseType: !20, size: 32, align: 32, offset: 1152)
!179 = !DIGlobalVariable(name: "g_Lights", linkageName: "\01?g_Lights@@3U?$ConstantBuffer@ULights@@@@A", scope: !0, file: !1, line: 120, type: !180, isLocal: false, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<Lights>", file: !1, line: 120, size: 32, align: 32, elements: !2, templateParams: !181)
!181 = !{!182}
!182 = !DITemplateTypeParameter(name: "T", type: !183)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lights", file: !1, line: 96, size: 32896, align: 32, elements: !184)
!184 = !{!185, !186, !187}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "numLights", scope: !183, file: !1, line: 98, baseType: !54, size: 32, align: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !183, file: !1, line: 99, baseType: !31, size: 96, align: 32, offset: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "lights", scope: !183, file: !1, line: 100, baseType: !188, size: 32768, align: 32, offset: 128)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 32768, align: 32, elements: !199)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light", file: !1, line: 84, size: 512, align: 32, elements: !190)
!190 = !{!191, !192, !193, !194, !195, !196, !197, !198}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !189, file: !1, line: 86, baseType: !54, size: 32, align: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !189, file: !1, line: 87, baseType: !31, size: 96, align: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Intensity", scope: !189, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !189, file: !1, line: 89, baseType: !31, size: 96, align: 32, offset: 160)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Range", scope: !189, file: !1, line: 90, baseType: !8, size: 32, align: 32, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "SpotAngle", scope: !189, file: !1, line: 91, baseType: !8, size: 32, align: 32, offset: 288)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !189, file: !1, line: 92, baseType: !39, size: 64, align: 32, offset: 320)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !189, file: !1, line: 93, baseType: !22, size: 128, align: 32, offset: 384)
!199 = !{!200}
!200 = !DISubrange(count: 64)
!201 = !DIGlobalVariable(name: "g_EnviormentTexure", linkageName: "\01?g_EnviormentTexure@@3V?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 122, type: !202, isLocal: false, isDefinition: true, variable: %"class.TextureCube<vector<float, 4> >"* @"\01?g_EnviormentTexure@@3V?$TextureCube@V?$vector@M$03@@@@A")
!202 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 122, size: 128, align: 32, elements: !2, templateParams: !145)
!203 = !DIGlobalVariable(name: "g_TerrainInfo", linkageName: "\01?g_TerrainInfo@@3U?$ConstantBuffer@UTerrainCBV@@@@A", scope: !0, file: !1, line: 124, type: !204, isLocal: false, isDefinition: true)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<TerrainCBV>", file: !1, line: 124, size: 32, align: 32, elements: !2, templateParams: !205)
!205 = !{!206}
!206 = !DITemplateTypeParameter(name: "T", type: !207)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "TerrainCBV", file: !1, line: 103, size: 512, align: 32, elements: !208)
!208 = !{!209, !210, !211, !221, !222}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "numLayer", scope: !207, file: !1, line: 105, baseType: !54, size: 32, align: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !207, file: !1, line: 106, baseType: !31, size: 96, align: 32, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "bHasDiffuse", scope: !207, file: !1, line: 107, baseType: !212, size: 128, align: 32, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "int4", file: !1, line: 124, baseType: !213)
!213 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 4>", file: !1, line: 124, size: 128, align: 32, elements: !214, templateParams: !219)
!214 = !{!215, !216, !217, !218}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !213, file: !1, line: 124, baseType: !20, size: 32, align: 32, flags: DIFlagPublic)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !213, file: !1, line: 124, baseType: !20, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !213, file: !1, line: 124, baseType: !20, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !213, file: !1, line: 124, baseType: !20, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!219 = !{!220, !30}
!220 = !DITemplateTypeParameter(name: "element", type: !20)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "bHasNormal", scope: !207, file: !1, line: 108, baseType: !212, size: 128, align: 32, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "bHasMask", scope: !207, file: !1, line: 109, baseType: !212, size: 128, align: 32, offset: 384)
!223 = !DIGlobalVariable(name: "g_LayerTexture", linkageName: "\01?g_LayerTexture@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 125, type: !224, isLocal: false, isDefinition: true, variable: [13 x %"class.Texture2D<vector<float, 4> >"]* @"\01?g_LayerTexture@@3PAV?$Texture2D@V?$vector@M$03@@@@A")
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 2080, align: 32, elements: !226)
!225 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 125, size: 160, align: 32, elements: !2, templateParams: !145)
!226 = !{!227}
!227 = !DISubrange(count: 13)
!228 = !DIGlobalVariable(name: "g_Sampler", linkageName: "\01?g_Sampler@@3USamplerState@@A", scope: !0, file: !1, line: 127, type: !229, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?g_Sampler@@3USamplerState@@A")
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 127, size: 32, align: 32, elements: !2)
!230 = !DIGlobalVariable(name: "l_Material", linkageName: "\01?l_Material@@3U?$ConstantBuffer@UHasMaterial@@@@A", scope: !0, file: !1, line: 131, type: !231, isLocal: false, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<HasMaterial>", file: !1, line: 131, size: 32, align: 32, elements: !2, templateParams: !232)
!232 = !{!233}
!233 = !DITemplateTypeParameter(name: "T", type: !234)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "HasMaterial", file: !1, line: 43, size: 1024, align: 32, elements: !235)
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "bHasAlbedoColor", scope: !234, file: !1, line: 45, baseType: !20, size: 32, align: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bHasEmissiveColor", scope: !234, file: !1, line: 46, baseType: !20, size: 32, align: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSpecularColor", scope: !234, file: !1, line: 47, baseType: !20, size: 32, align: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "bHasGlossiness", scope: !234, file: !1, line: 48, baseType: !20, size: 32, align: 32, offset: 96)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSmoothness", scope: !234, file: !1, line: 49, baseType: !20, size: 32, align: 32, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "bHasMetallic", scope: !234, file: !1, line: 50, baseType: !20, size: 32, align: 32, offset: 160)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSpecularHighlight", scope: !234, file: !1, line: 51, baseType: !20, size: 32, align: 32, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "bHasGlossyReflection", scope: !234, file: !1, line: 52, baseType: !20, size: 32, align: 32, offset: 224)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "bHasAlbedoMap", scope: !234, file: !1, line: 54, baseType: !20, size: 32, align: 32, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSpecularMap", scope: !234, file: !1, line: 55, baseType: !20, size: 32, align: 32, offset: 288)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "bHasNormalMap", scope: !234, file: !1, line: 56, baseType: !20, size: 32, align: 32, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "bHasMetallicMap", scope: !234, file: !1, line: 57, baseType: !20, size: 32, align: 32, offset: 352)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "bHasEmissionMap", scope: !234, file: !1, line: 58, baseType: !20, size: 32, align: 32, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "bHasDetailAlbedoMap", scope: !234, file: !1, line: 59, baseType: !20, size: 32, align: 32, offset: 416)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "bHasDetailNormalMap", scope: !234, file: !1, line: 60, baseType: !20, size: 32, align: 32, offset: 448)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Glossiness", scope: !234, file: !1, line: 61, baseType: !8, size: 32, align: 32, offset: 480)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "AlbedoColor", scope: !234, file: !1, line: 63, baseType: !22, size: 128, align: 32, offset: 512)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "EmissiveColor", scope: !234, file: !1, line: 64, baseType: !22, size: 128, align: 32, offset: 640)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "SpecularColor", scope: !234, file: !1, line: 65, baseType: !22, size: 128, align: 32, offset: 768)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Smoothness", scope: !234, file: !1, line: 66, baseType: !8, size: 32, align: 32, offset: 896)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !234, file: !1, line: 67, baseType: !8, size: 32, align: 32, offset: 928)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "SpecularHighlight", scope: !234, file: !1, line: 68, baseType: !8, size: 32, align: 32, offset: 960)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "GlossyReflection", scope: !234, file: !1, line: 69, baseType: !8, size: 32, align: 32, offset: 992)
!259 = !DIGlobalVariable(name: "l_Mesh", linkageName: "\01?l_Mesh@@3U?$ConstantBuffer@UHasMesh@@@@A", scope: !0, file: !1, line: 132, type: !260, isLocal: false, isDefinition: true)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<HasMesh>", file: !1, line: 132, size: 32, align: 32, elements: !2, templateParams: !261)
!261 = !{!262}
!262 = !DITemplateTypeParameter(name: "T", type: !263)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "HasMesh", file: !1, line: 72, size: 256, align: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "bHasVertex", scope: !263, file: !1, line: 74, baseType: !20, size: 32, align: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "bHasColor", scope: !263, file: !1, line: 75, baseType: !20, size: 32, align: 32, offset: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "bHasTex0", scope: !263, file: !1, line: 76, baseType: !20, size: 32, align: 32, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "bHasTex1", scope: !263, file: !1, line: 77, baseType: !20, size: 32, align: 32, offset: 96)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "bHasNormals", scope: !263, file: !1, line: 78, baseType: !20, size: 32, align: 32, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "bHasTangenrs", scope: !263, file: !1, line: 79, baseType: !20, size: 32, align: 32, offset: 160)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "bHasBiTangents", scope: !263, file: !1, line: 80, baseType: !20, size: 32, align: 32, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSubMeshes", scope: !263, file: !1, line: 81, baseType: !20, size: 32, align: 32, offset: 224)
!273 = !DIGlobalVariable(name: "l_Vertices", linkageName: "\01?l_Vertices@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 134, type: !274, isLocal: false, isDefinition: true)
!274 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 3> >", file: !1, line: 134, size: 96, align: 32, elements: !2, templateParams: !275)
!275 = !{!276}
!276 = !DITemplateTypeParameter(name: "element", type: !32)
!277 = !DIGlobalVariable(name: "l_Colors", linkageName: "\01?l_Colors@@3V?$StructuredBuffer@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 135, type: !278, isLocal: false, isDefinition: true)
!278 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 4> >", file: !1, line: 135, size: 128, align: 32, elements: !2, templateParams: !145)
!279 = !DIGlobalVariable(name: "l_Tex0", linkageName: "\01?l_Tex0@@3V?$StructuredBuffer@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 136, type: !280, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<vector<float, 2> >"* @"\01?l_Tex0@@3V?$StructuredBuffer@V?$vector@M$01@@@@A")
!280 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 2> >", file: !1, line: 136, size: 64, align: 32, elements: !2, templateParams: !281)
!281 = !{!282}
!282 = !DITemplateTypeParameter(name: "element", type: !40)
!283 = !DIGlobalVariable(name: "l_Tex1", linkageName: "\01?l_Tex1@@3V?$StructuredBuffer@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 137, type: !280, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<vector<float, 2> >"* @"\01?l_Tex1@@3V?$StructuredBuffer@V?$vector@M$01@@@@A")
!284 = !DIGlobalVariable(name: "l_Normals", linkageName: "\01?l_Normals@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 138, type: !274, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<vector<float, 3> >"* @"\01?l_Normals@@3V?$StructuredBuffer@V?$vector@M$02@@@@A")
!285 = !DIGlobalVariable(name: "l_Tangents", linkageName: "\01?l_Tangents@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 139, type: !274, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<vector<float, 3> >"* @"\01?l_Tangents@@3V?$StructuredBuffer@V?$vector@M$02@@@@A")
!286 = !DIGlobalVariable(name: "l_BiTangents", linkageName: "\01?l_BiTangents@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 140, type: !274, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<vector<float, 3> >"* @"\01?l_BiTangents@@3V?$StructuredBuffer@V?$vector@M$02@@@@A")
!287 = !DIGlobalVariable(name: "l_Indices", linkageName: "\01?l_Indices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 141, type: !288, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<unsigned int>"* @"\01?l_Indices@@3V?$StructuredBuffer@I@@A")
!288 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 141, size: 32, align: 32, elements: !2, templateParams: !289)
!289 = !{!290}
!290 = !DITemplateTypeParameter(name: "element", type: !55)
!291 = !DIGlobalVariable(name: "l_AlbedoMap", linkageName: "\01?l_AlbedoMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 143, type: !225, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?l_AlbedoMap@@3V?$Texture2D@V?$vector@M$03@@@@A")
!292 = !DIGlobalVariable(name: "l_SpecularMap", linkageName: "\01?l_SpecularMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 144, type: !225, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?l_SpecularMap@@3V?$Texture2D@V?$vector@M$03@@@@A")
