#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: 9930b8dea1c1f2f3ded0e308dfbb8020.pdb
; shader hash: 9930b8dea1c1f2f3ded0e308dfbb8020
;
; Buffer Definitions:
;
; cbuffer g_CameraInfo
; {
;
;   struct g_CameraInfo
;   {
;
;       struct struct.CameraInfo
;       {
;
;           column_major float4x4 mtxViewProj;        ; Offset:    0
;           column_major float4x4 mtxInverseViewProj; ; Offset:   64
;           float3 cameraEye;                         ; Offset:  128
;       
;       } g_CameraInfo;                               ; Offset:    0
;
;   
;   } g_CameraInfo;                                   ; Offset:    0 Size:   140
;
; }
;
; cbuffer l_Material
; {
;
;   struct l_Material
;   {
;
;       struct struct.HasMaterial
;       {
;
;           int bHasAlbedoColor;                      ; Offset:    0
;           int bHasEmissiveColor;                    ; Offset:    4
;           int bHasSpecularColor;                    ; Offset:    8
;           int bHasGlossiness;                       ; Offset:   12
;           int bHasSmoothness;                       ; Offset:   16
;           int bHasMetallic;                         ; Offset:   20
;           int bHasSpecularHighlight;                ; Offset:   24
;           int bHasGlossyReflection;                 ; Offset:   28
;           int bHasAlbedoMap;                        ; Offset:   32

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !106)
!1 = !DIFile(filename: "RaytracingShader.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16, !31, !39}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 116, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 116, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 116, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 116, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 116, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 116, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 140, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 140, size: 288, align: 32, elements: !18, templateParams: !28)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !17, file: !1, line: 140, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !17, file: !1, line: 140, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !17, file: !1, line: 140, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !17, file: !1, line: 140, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !17, file: !1, line: 140, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !17, file: !1, line: 140, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !17, file: !1, line: 140, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !17, file: !1, line: 140, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !17, file: !1, line: 140, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!28 = !{!13, !29, !30}
!29 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!30 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 3)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 110, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 110, size: 96, align: 32, elements: !33, templateParams: !37)
!33 = !{!34, !35, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !32, file: !1, line: 110, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !32, file: !1, line: 110, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !32, file: !1, line: 110, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!37 = !{!13, !38}
!38 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !41, templateParams: !44)
!41 = !{!42, !43}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !40, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !40, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !{!13, !45}
!45 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!46 = !{!47, !53, !57, !68, !71, !75, !78, !86, !93, !99, !100, !103}
!47 = !DISubprogram(name: "GetTexCoord", linkageName: "\01?GetTexCoord@@YA?AV?$vector@M$01@@Y02V1@V1@@Z", scope: !1, file: !1, line: 106, type: !48, isLocal: false, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: false)
!48 = !DISubroutineType(types: !49)
!49 = !{!39, !50, !39}
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 192, align: 32, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 3)
!53 = !DISubprogram(name: "GetHitNormal", linkageName: "\01?GetHitNormal@@YA?AV?$vector@M$02@@Y02V1@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 112, type: !54, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: false)
!54 = !DISubroutineType(types: !55)
!55 = !{!31, !56, !39}
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 288, align: 32, elements: !51)
!57 = !DISubprogram(name: "TraceRadianceRay", linkageName: "\01?TraceRadianceRay@@YA?AV?$vector@M$03@@URayDesc@@I@Z", scope: !1, file: !1, line: 118, type: !58, isLocal: false, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: false)
!58 = !DISubroutineType(types: !59)
!59 = !{!4, !60, !66}
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 116, size: 256, align: 32, elements: !61)
!61 = !{!62, !63, !64, !65}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !60, file: !1, line: 116, baseType: !32, size: 96, align: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !60, file: !1, line: 116, baseType: !8, size: 32, align: 32, offset: 96)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !60, file: !1, line: 116, baseType: !32, size: 96, align: 32, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !60, file: !1, line: 116, baseType: !8, size: 32, align: 32, offset: 224)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 116, baseType: !67)
!67 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!68 = !DISubprogram(name: "CalculatePhongModel", linkageName: "\01?CalculatePhongModel@@YA?AV?$vector@M$03@@V1@V?$vector@M$02@@@Z", scope: !1, file: !1, line: 137, type: !69, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: false)
!69 = !DISubroutineType(types: !70)
!70 = !{!4, !4, !31}
!71 = !DISubprogram(name: "CheckTheShadow", linkageName: "\01?CheckTheShadow@@YA_NURayDesc@@I@Z", scope: !1, file: !1, line: 165, type: !72, isLocal: false, isDefinition: true, scopeLine: 166, flags: DIFlagPrototyped, isOptimized: false)
!72 = !DISubroutineType(types: !73)
!73 = !{!74, !60, !66}
!74 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!75 = !DISubprogram(name: "RayGenShader", linkageName: "\01?RayGenShader@@YAXXZ", scope: !1, file: !1, line: 187, type: !76, isLocal: false, isDefinition: true, scopeLine: 188, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGenShader@@YAXXZ")
!76 = !DISubroutineType(types: !77)
!77 = !{null}
!78 = !DISubprogram(name: "RadianceMiss", linkageName: "\01?RadianceMiss@@YAXURadiancePayload@@@Z", scope: !1, file: !1, line: 208, type: !79, isLocal: false, isDefinition: true, scopeLine: 209, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RadiancePayload*)* @"\01?RadianceMiss@@YAXURadiancePayload@@@Z")
!79 = !DISubroutineType(types: !80)
!80 = !{null, !81}
!81 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !82)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "RadiancePayload", file: !1, line: 2, size: 160, align: 32, elements: !83)
!83 = !{!84, !85}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "RayColor", scope: !82, file: !1, line: 4, baseType: !4, size: 128, align: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "RayDepth", scope: !82, file: !1, line: 5, baseType: !66, size: 32, align: 32, offset: 128)
!86 = !DISubprogram(name: "ShadowMiss", linkageName: "\01?ShadowMiss@@YAXUShadowPayload@@@Z", scope: !1, file: !1, line: 222, type: !87, isLocal: false, isDefinition: true, scopeLine: 223, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.ShadowPayload*)* @"\01?ShadowMiss@@YAXUShadowPayload@@@Z")
!87 = !DISubroutineType(types: !88)
!88 = !{null, !89}
!89 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !90)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "ShadowPayload", file: !1, line: 8, size: 32, align: 32, elements: !91)
!91 = !{!92}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "bShadow", scope: !90, file: !1, line: 10, baseType: !74, size: 32, align: 32)
!93 = !DISubprogram(name: "RadianceAnyHit", linkageName: "\01?RadianceAnyHit@@YAXURadiancePayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 228, type: !94, isLocal: false, isDefinition: true, scopeLine: 229, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RadiancePayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?RadianceAnyHit@@YAXURadiancePayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!94 = !DISubroutineType(types: !95)
!95 = !{null, !81, !96}
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 225, size: 64, align: 32, elements: !97)
!97 = !{!98}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !96, file: !1, line: 225, baseType: !40, size: 64, align: 32)
!99 = !DISubprogram(name: "RadianceClosestHit", linkageName: "\01?RadianceClosestHit@@YAXURadiancePayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 274, type: !94, isLocal: false, isDefinition: true, scopeLine: 275, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RadiancePayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?RadianceClosestHit@@YAXURadiancePayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!100 = !DISubprogram(name: "ShadowClosestHit", linkageName: "\01?ShadowClosestHit@@YAXUShadowPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 345, type: !101, isLocal: false, isDefinition: true, scopeLine: 346, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.ShadowPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ShadowClosestHit@@YAXUShadowPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!101 = !DISubroutineType(types: !102)
!102 = !{null, !89, !96}
!103 = !DISubprogram(name: "GetWorldPosition", linkageName: "\01?GetWorldPosition@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 101, type: !104, isLocal: false, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false)
!104 = !DISubroutineType(types: !105)
!105 = !{!31}
!106 = !{!107, !109, !110, !112, !116, !146, !148, !177, !191, !195, !197, !201, !202, !203, !204, !205, !209, !211, !212, !213, !214, !215, !216}
!107 = !DIGlobalVariable(name: "RAY_FLAG_CULL_BACK_FACING_TRIANGLES", scope: !0, file: !1, line: 127, type: !108, isLocal: true, isDefinition: true, variable: i32 16)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!109 = !DIGlobalVariable(name: "RAY_FLAG_FORCE_OPAQUE", scope: !0, file: !1, line: 174, type: !108, isLocal: true, isDefinition: true, variable: i32 1)
!110 = !DIGlobalVariable(name: "g_Scene", linkageName: "\01?g_Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 70, type: !111, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?g_Scene@@3URaytracingAccelerationStructure@@A")
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 70, size: 32, align: 32, elements: !2)
!112 = !DIGlobalVariable(name: "uav", linkageName: "\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 72, type: !113, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!113 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 72, size: 128, align: 32, elements: !2, templateParams: !114)
!114 = !{!115}
!115 = !DITemplateTypeParameter(name: "element", type: !5)
!116 = !DIGlobalVariable(name: "g_CameraInfo", linkageName: "\01?g_CameraInfo@@3U?$ConstantBuffer@UCameraInfo@@@@A", scope: !0, file: !1, line: 74, type: !117, isLocal: false, isDefinition: true)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<CameraInfo>", file: !1, line: 74, size: 32, align: 32, elements: !2, templateParams: !118)
!118 = !{!119}
!119 = !DITemplateTypeParameter(name: "T", type: !120)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "CameraInfo", file: !1, line: 13, size: 1120, align: 32, elements: !121)
!121 = !{!122, !144, !145}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "mtxViewProj", scope: !120, file: !1, line: 15, baseType: !123, size: 512, align: 32)
!123 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 74, size: 512, align: 32, elements: !124, templateParams: !141)
!124 = !{!125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !123, file: !1, line: 74, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !123, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !123, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !123, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !123, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !123, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !123, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !123, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !123, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !123, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !123, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !123, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !123, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !123, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !123, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !123, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!141 = !{!13, !142, !143}
!142 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!143 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "mtxInverseViewProj", scope: !120, file: !1, line: 16, baseType: !123, size: 512, align: 32, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "cameraEye", scope: !120, file: !1, line: 17, baseType: !31, size: 96, align: 32, offset: 1024)
!146 = !DIGlobalVariable(name: "g_Sampler", linkageName: "\01?g_Sampler@@3USamplerState@@A", scope: !0, file: !1, line: 76, type: !147, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?g_Sampler@@3USamplerState@@A")
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 76, size: 32, align: 32, elements: !2)
!148 = !DIGlobalVariable(name: "l_Material", linkageName: "\01?l_Material@@3U?$ConstantBuffer@UHasMaterial@@@@A", scope: !0, file: !1, line: 80, type: !149, isLocal: false, isDefinition: true)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<HasMaterial>", file: !1, line: 80, size: 32, align: 32, elements: !2, templateParams: !150)
!150 = !{!151}
!151 = !DITemplateTypeParameter(name: "T", type: !152)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "HasMaterial", file: !1, line: 21, size: 1024, align: 32, elements: !153)
!153 = !{!154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "bHasAlbedoColor", scope: !152, file: !1, line: 23, baseType: !15, size: 32, align: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "bHasEmissiveColor", scope: !152, file: !1, line: 24, baseType: !15, size: 32, align: 32, offset: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSpecularColor", scope: !152, file: !1, line: 25, baseType: !15, size: 32, align: 32, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "bHasGlossiness", scope: !152, file: !1, line: 26, baseType: !15, size: 32, align: 32, offset: 96)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSmoothness", scope: !152, file: !1, line: 27, baseType: !15, size: 32, align: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "bHasMetallic", scope: !152, file: !1, line: 28, baseType: !15, size: 32, align: 32, offset: 160)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSpecularHighlight", scope: !152, file: !1, line: 29, baseType: !15, size: 32, align: 32, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "bHasGlossyReflection", scope: !152, file: !1, line: 30, baseType: !15, size: 32, align: 32, offset: 224)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "bHasAlbedoMap", scope: !152, file: !1, line: 32, baseType: !15, size: 32, align: 32, offset: 256)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSpecularMap", scope: !152, file: !1, line: 33, baseType: !15, size: 32, align: 32, offset: 288)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "bHasNormalMap", scope: !152, file: !1, line: 34, baseType: !15, size: 32, align: 32, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "bHasMetallicMap", scope: !152, file: !1, line: 35, baseType: !15, size: 32, align: 32, offset: 352)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "bHasEmissionMap", scope: !152, file: !1, line: 36, baseType: !15, size: 32, align: 32, offset: 384)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "bHasDetailAlbedoMap", scope: !152, file: !1, line: 37, baseType: !15, size: 32, align: 32, offset: 416)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "bHasDetailNormalMap", scope: !152, file: !1, line: 38, baseType: !15, size: 32, align: 32, offset: 448)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "AlbedoColor", scope: !152, file: !1, line: 40, baseType: !4, size: 128, align: 32, offset: 480)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "EmissiveColor", scope: !152, file: !1, line: 41, baseType: !4, size: 128, align: 32, offset: 608)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "SpecularColor", scope: !152, file: !1, line: 42, baseType: !4, size: 128, align: 32, offset: 736)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Glossiness", scope: !152, file: !1, line: 43, baseType: !8, size: 32, align: 32, offset: 864)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Smoothness", scope: !152, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 896)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !152, file: !1, line: 45, baseType: !8, size: 32, align: 32, offset: 928)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "SpecularHighlight", scope: !152, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 960)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "GlossyReflection", scope: !152, file: !1, line: 47, baseType: !8, size: 32, align: 32, offset: 992)
!177 = !DIGlobalVariable(name: "l_Mesh", linkageName: "\01?l_Mesh@@3U?$ConstantBuffer@UHasMesh@@@@A", scope: !0, file: !1, line: 81, type: !178, isLocal: false, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<HasMesh>", file: !1, line: 81, size: 32, align: 32, elements: !2, templateParams: !179)
!179 = !{!180}
!180 = !DITemplateTypeParameter(name: "T", type: !181)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "HasMesh", file: !1, line: 50, size: 256, align: 32, elements: !182)
!182 = !{!183, !184, !185, !186, !187, !188, !189, !190}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "bHasVertex", scope: !181, file: !1, line: 52, baseType: !15, size: 32, align: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "bHasColor", scope: !181, file: !1, line: 53, baseType: !15, size: 32, align: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "bHasTex0", scope: !181, file: !1, line: 54, baseType: !15, size: 32, align: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "bHasTex1", scope: !181, file: !1, line: 55, baseType: !15, size: 32, align: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "bHasNormals", scope: !181, file: !1, line: 56, baseType: !15, size: 32, align: 32, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "bHasTangenrs", scope: !181, file: !1, line: 57, baseType: !15, size: 32, align: 32, offset: 160)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "bHasBiTangents", scope: !181, file: !1, line: 58, baseType: !15, size: 32, align: 32, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSubMeshes", scope: !181, file: !1, line: 59, baseType: !15, size: 32, align: 32, offset: 224)
!191 = !DIGlobalVariable(name: "l_Vertices", linkageName: "\01?l_Vertices@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 83, type: !192, isLocal: false, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 3> >", file: !1, line: 83, size: 96, align: 32, elements: !2, templateParams: !193)
!193 = !{!194}
!194 = !DITemplateTypeParameter(name: "element", type: !32)
!195 = !DIGlobalVariable(name: "l_Colors", linkageName: "\01?l_Colors@@3V?$StructuredBuffer@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 84, type: !196, isLocal: false, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 4> >", file: !1, line: 84, size: 128, align: 32, elements: !2, templateParams: !114)
!197 = !DIGlobalVariable(name: "l_Tex0", linkageName: "\01?l_Tex0@@3V?$StructuredBuffer@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 85, type: !198, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<vector<float, 2> >"* @"\01?l_Tex0@@3V?$StructuredBuffer@V?$vector@M$01@@@@A")
!198 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 2> >", file: !1, line: 85, size: 64, align: 32, elements: !2, templateParams: !199)
!199 = !{!200}
!200 = !DITemplateTypeParameter(name: "element", type: !40)
!201 = !DIGlobalVariable(name: "l_Tex1", linkageName: "\01?l_Tex1@@3V?$StructuredBuffer@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 86, type: !198, isLocal: false, isDefinition: true)
!202 = !DIGlobalVariable(name: "l_Normals", linkageName: "\01?l_Normals@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 87, type: !192, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<vector<float, 3> >"* @"\01?l_Normals@@3V?$StructuredBuffer@V?$vector@M$02@@@@A")
!203 = !DIGlobalVariable(name: "l_Tangents", linkageName: "\01?l_Tangents@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 88, type: !192, isLocal: false, isDefinition: true)
!204 = !DIGlobalVariable(name: "l_BiTangents", linkageName: "\01?l_BiTangents@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 89, type: !192, isLocal: false, isDefinition: true)
!205 = !DIGlobalVariable(name: "l_Indices", linkageName: "\01?l_Indices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 90, type: !206, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<unsigned int>"* @"\01?l_Indices@@3V?$StructuredBuffer@I@@A")
!206 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 90, size: 32, align: 32, elements: !2, templateParams: !207)
!207 = !{!208}
!208 = !DITemplateTypeParameter(name: "element", type: !67)
!209 = !DIGlobalVariable(name: "l_AlbedoMap", linkageName: "\01?l_AlbedoMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 92, type: !210, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?l_AlbedoMap@@3V?$Texture2D@V?$vector@M$03@@@@A")
!210 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 92, size: 160, align: 32, elements: !2, templateParams: !114)
!211 = !DIGlobalVariable(name: "l_SpecularMap", linkageName: "\01?l_SpecularMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 93, type: !210, isLocal: false, isDefinition: true)
!212 = !DIGlobalVariable(name: "l_NormalMap", linkageName: "\01?l_NormalMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 94, type: !210, isLocal: false, isDefinition: true)
!213 = !DIGlobalVariable(name: "l_MetallicMap", linkageName: "\01?l_MetallicMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 95, type: !210, isLocal: false, isDefinition: true)
