#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: 1f782cc96d931a79ccf6853ab5990219.pdb
; shader hash: 1f782cc96d931a79ccf6853ab5990219
;
; Buffer Definitions:
;
; cbuffer l_Material
; {
;
;   struct l_Material
;   {
;
;       struct struct.HasMaterial
;       {
;
;           bool bHasAlbedoColor;                     ; Offset:    0
;           bool bHasEmissiveColor;                   ; Offset:    4
;           bool bHasSpecularColor;                   ; Offset:    8
;           bool bHasGlossiness;                      ; Offset:   12
;           bool bHasSmoothness;                      ; Offset:   16
;           bool bHasMetallic;                        ; Offset:   20
;           bool bHasSpecularHighlight;               ; Offset:   24
;           bool bHasGlossyReflection;                ; Offset:   28
;           bool bHasAlbedoMap;                       ; Offset:   32
;           bool bHasSpecularMap;                     ; Offset:   36
;           bool bHasNormalMap;                       ; Offset:   40
;           bool bHasMetallicMap;                     ; Offset:   44
;           bool bHasEmissionMap;                     ; Offset:   48
;           bool bHasDetailAlbedoMap;                 ; Offset:   52
;           bool bHasDetailNormalMap;                 ; Offset:   56
;           float4 AlbedoColor;                       ; Offset:   64

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !48)
!1 = !DIFile(filename: "RaytracingShader.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15, !24}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 95, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 95, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 95, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 95, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 95, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 106, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 106, size: 128, align: 32, elements: !17, templateParams: !22)
!17 = !{!18, !19, !20, !21}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 106, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 106, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !16, file: !1, line: 106, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !16, file: !1, line: 106, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!22 = !{!12, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 93, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 93, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 93, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 93, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!12, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!31 = !{!32, !35, !42}
!32 = !DISubprogram(name: "RayGenShader", linkageName: "\01?RayGenShader@@YAXXZ", scope: !1, file: !1, line: 90, type: !33, isLocal: false, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGenShader@@YAXXZ")
!33 = !DISubroutineType(types: !34)
!34 = !{null}
!35 = !DISubprogram(name: "Miss", linkageName: "\01?Miss@@YAXUPayload@@@Z", scope: !1, file: !1, line: 110, type: !36, isLocal: false, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z")
!36 = !DISubroutineType(types: !37)
!37 = !{null, !38}
!38 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "Payload", file: !1, line: 2, size: 96, align: 32, elements: !40)
!40 = !{!41}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "RayColor", scope: !39, file: !1, line: 4, baseType: !4, size: 96, align: 32)
!42 = !DISubprogram(name: "ClosestHit", linkageName: "\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 116, type: !43, isLocal: false, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!43 = !DISubroutineType(types: !44)
!44 = !{null, !38, !45}
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 113, size: 64, align: 32, elements: !46)
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !45, file: !1, line: 113, baseType: !25, size: 64, align: 32)
!48 = !{!49, !52, !54, !58, !88, !90, !120, !134, !138, !140, !144, !145, !146, !147, !148, !152, !154, !155, !156, !157, !158, !159, !160, !162, !164, !166}
!49 = !DIGlobalVariable(name: "RAY_FLAG_NONE", scope: !0, file: !1, line: 104, type: !50, isLocal: true, isDefinition: true, variable: i32 0)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!51 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!52 = !DIGlobalVariable(name: "g_Scene", linkageName: "\01?g_Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 56, type: !53, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?g_Scene@@3URaytracingAccelerationStructure@@A")
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 56, size: 32, align: 32, elements: !2)
!54 = !DIGlobalVariable(name: "uav", linkageName: "\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 58, type: !55, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!55 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 58, size: 128, align: 32, elements: !2, templateParams: !56)
!56 = !{!57}
!57 = !DITemplateTypeParameter(name: "element", type: !16)
!58 = !DIGlobalVariable(name: "g_CameraInfo", linkageName: "\01?g_CameraInfo@@3U?$ConstantBuffer@UCameraInfo@@@@A", scope: !0, file: !1, line: 60, type: !59, isLocal: false, isDefinition: true)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<CameraInfo>", file: !1, line: 60, size: 32, align: 32, elements: !2, templateParams: !60)
!60 = !{!61}
!61 = !DITemplateTypeParameter(name: "T", type: !62)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "CameraInfo", file: !1, line: 7, size: 1120, align: 32, elements: !63)
!63 = !{!64, !86, !87}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "mtxViewProj", scope: !62, file: !1, line: 9, baseType: !65, size: 512, align: 32)
!65 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 60, size: 512, align: 32, elements: !66, templateParams: !83)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!83 = !{!12, !84, !85}
!84 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 4)
!85 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 4)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mtxInverseViewProj", scope: !62, file: !1, line: 10, baseType: !65, size: 512, align: 32, offset: 512)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "cameraEye", scope: !62, file: !1, line: 11, baseType: !4, size: 96, align: 32, offset: 1024)
!88 = !DIGlobalVariable(name: "g_Sampler", linkageName: "\01?g_Sampler@@3USamplerState@@A", scope: !0, file: !1, line: 62, type: !89, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?g_Sampler@@3USamplerState@@A")
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 62, size: 32, align: 32, elements: !2)
!90 = !DIGlobalVariable(name: "l_Material", linkageName: "\01?l_Material@@3U?$ConstantBuffer@UHasMaterial@@@@A", scope: !0, file: !1, line: 66, type: !91, isLocal: false, isDefinition: true)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<HasMaterial>", file: !1, line: 66, size: 32, align: 32, elements: !2, templateParams: !92)
!92 = !{!93}
!93 = !DITemplateTypeParameter(name: "T", type: !94)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "HasMaterial", file: !1, line: 14, size: 1024, align: 32, elements: !95)
!95 = !{!96, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "bHasAlbedoColor", scope: !94, file: !1, line: 16, baseType: !97, size: 32, align: 32)
!97 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "bHasEmissiveColor", scope: !94, file: !1, line: 17, baseType: !97, size: 32, align: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSpecularColor", scope: !94, file: !1, line: 18, baseType: !97, size: 32, align: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "bHasGlossiness", scope: !94, file: !1, line: 19, baseType: !97, size: 32, align: 32, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSmoothness", scope: !94, file: !1, line: 20, baseType: !97, size: 32, align: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "bHasMetallic", scope: !94, file: !1, line: 21, baseType: !97, size: 32, align: 32, offset: 160)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSpecularHighlight", scope: !94, file: !1, line: 22, baseType: !97, size: 32, align: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "bHasGlossyReflection", scope: !94, file: !1, line: 23, baseType: !97, size: 32, align: 32, offset: 224)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "bHasAlbedoMap", scope: !94, file: !1, line: 25, baseType: !97, size: 32, align: 32, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSpecularMap", scope: !94, file: !1, line: 26, baseType: !97, size: 32, align: 32, offset: 288)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "bHasNormalMap", scope: !94, file: !1, line: 27, baseType: !97, size: 32, align: 32, offset: 320)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "bHasMetallicMap", scope: !94, file: !1, line: 28, baseType: !97, size: 32, align: 32, offset: 352)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "bHasEmissionMap", scope: !94, file: !1, line: 29, baseType: !97, size: 32, align: 32, offset: 384)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "bHasDetailAlbedoMap", scope: !94, file: !1, line: 30, baseType: !97, size: 32, align: 32, offset: 416)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "bHasDetailNormalMap", scope: !94, file: !1, line: 31, baseType: !97, size: 32, align: 32, offset: 448)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "AlbedoColor", scope: !94, file: !1, line: 33, baseType: !15, size: 128, align: 32, offset: 480)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "EmissiveColor", scope: !94, file: !1, line: 34, baseType: !15, size: 128, align: 32, offset: 608)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "SpecularColor", scope: !94, file: !1, line: 35, baseType: !15, size: 128, align: 32, offset: 736)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Glossiness", scope: !94, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 864)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "Smoothness", scope: !94, file: !1, line: 37, baseType: !8, size: 32, align: 32, offset: 896)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !94, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 928)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "SpecularHighlight", scope: !94, file: !1, line: 39, baseType: !8, size: 32, align: 32, offset: 960)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "GlossyReflection", scope: !94, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 992)
!120 = !DIGlobalVariable(name: "l_Mesh", linkageName: "\01?l_Mesh@@3U?$ConstantBuffer@UHasMesh@@@@A", scope: !0, file: !1, line: 67, type: !121, isLocal: false, isDefinition: true)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<HasMesh>", file: !1, line: 67, size: 32, align: 32, elements: !2, templateParams: !122)
!122 = !{!123}
!123 = !DITemplateTypeParameter(name: "T", type: !124)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "HasMesh", file: !1, line: 43, size: 256, align: 32, elements: !125)
!125 = !{!126, !127, !128, !129, !130, !131, !132, !133}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "bHasVertex", scope: !124, file: !1, line: 45, baseType: !97, size: 32, align: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "bHasColor", scope: !124, file: !1, line: 46, baseType: !97, size: 32, align: 32, offset: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "bHasTex0", scope: !124, file: !1, line: 47, baseType: !97, size: 32, align: 32, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "bHasTex1", scope: !124, file: !1, line: 48, baseType: !97, size: 32, align: 32, offset: 96)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "bHasNormals", scope: !124, file: !1, line: 49, baseType: !97, size: 32, align: 32, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "bHasTangenrs", scope: !124, file: !1, line: 50, baseType: !97, size: 32, align: 32, offset: 160)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "bHasBiTangents", scope: !124, file: !1, line: 51, baseType: !97, size: 32, align: 32, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSubMeshes", scope: !124, file: !1, line: 52, baseType: !97, size: 32, align: 32, offset: 224)
!134 = !DIGlobalVariable(name: "l_Vertices", linkageName: "\01?l_Vertices@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 69, type: !135, isLocal: false, isDefinition: true)
!135 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 3> >", file: !1, line: 69, size: 96, align: 32, elements: !2, templateParams: !136)
!136 = !{!137}
!137 = !DITemplateTypeParameter(name: "element", type: !5)
!138 = !DIGlobalVariable(name: "l_Colors", linkageName: "\01?l_Colors@@3V?$StructuredBuffer@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 70, type: !139, isLocal: false, isDefinition: true)
!139 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 4> >", file: !1, line: 70, size: 128, align: 32, elements: !2, templateParams: !56)
!140 = !DIGlobalVariable(name: "l_Tex0", linkageName: "\01?l_Tex0@@3V?$StructuredBuffer@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 71, type: !141, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<vector<float, 2> >"* @"\01?l_Tex0@@3V?$StructuredBuffer@V?$vector@M$01@@@@A")
!141 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 2> >", file: !1, line: 71, size: 64, align: 32, elements: !2, templateParams: !142)
!142 = !{!143}
!143 = !DITemplateTypeParameter(name: "element", type: !25)
!144 = !DIGlobalVariable(name: "l_Tex1", linkageName: "\01?l_Tex1@@3V?$StructuredBuffer@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 72, type: !141, isLocal: false, isDefinition: true)
!145 = !DIGlobalVariable(name: "l_Normals", linkageName: "\01?l_Normals@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 73, type: !135, isLocal: false, isDefinition: true)
!146 = !DIGlobalVariable(name: "l_Tangents", linkageName: "\01?l_Tangents@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 74, type: !135, isLocal: false, isDefinition: true)
!147 = !DIGlobalVariable(name: "l_BiTangents", linkageName: "\01?l_BiTangents@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 75, type: !135, isLocal: false, isDefinition: true)
!148 = !DIGlobalVariable(name: "l_Indices", linkageName: "\01?l_Indices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 76, type: !149, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<unsigned int>"* @"\01?l_Indices@@3V?$StructuredBuffer@I@@A")
!149 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 76, size: 32, align: 32, elements: !2, templateParams: !150)
!150 = !{!151}
!151 = !DITemplateTypeParameter(name: "element", type: !51)
!152 = !DIGlobalVariable(name: "l_AlbedoMap", linkageName: "\01?l_AlbedoMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 78, type: !153, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?l_AlbedoMap@@3V?$Texture2D@V?$vector@M$03@@@@A")
!153 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 78, size: 160, align: 32, elements: !2, templateParams: !56)
!154 = !DIGlobalVariable(name: "l_SpecularMap", linkageName: "\01?l_SpecularMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 79, type: !153, isLocal: false, isDefinition: true)
!155 = !DIGlobalVariable(name: "l_NormalMap", linkageName: "\01?l_NormalMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 80, type: !153, isLocal: false, isDefinition: true)
!156 = !DIGlobalVariable(name: "l_MetallicMap", linkageName: "\01?l_MetallicMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 81, type: !153, isLocal: false, isDefinition: true)
!157 = !DIGlobalVariable(name: "l_EmissionMap", linkageName: "\01?l_EmissionMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 82, type: !153, isLocal: false, isDefinition: true)
!158 = !DIGlobalVariable(name: "l_DetailAlbedoMap", linkageName: "\01?l_DetailAlbedoMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 83, type: !153, isLocal: false, isDefinition: true)
!159 = !DIGlobalVariable(name: "l_DetailNormalMap", linkageName: "\01?l_DetailNormalMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 84, type: !153, isLocal: false, isDefinition: true)
!160 = !DIGlobalVariable(name: "camera", scope: !0, file: !1, line: 87, type: !161, isLocal: true, isDefinition: true)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!162 = !DIGlobalVariable(name: "camera.1", linkageName: "camera.1", scope: !0, file: !1, line: 87, type: !163, isLocal: false, isDefinition: true, variable: float* @camera.1)
!163 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !161, size: 32, align: 4, offset: 32)
!164 = !DIGlobalVariable(name: "camera.0", linkageName: "camera.0", scope: !0, file: !1, line: 87, type: !165, isLocal: false, isDefinition: true, variable: float* @camera.0)
!165 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !161, size: 32, align: 4)
!166 = !DIGlobalVariable(name: "camera.2", linkageName: "camera.2", scope: !0, file: !1, line: 87, type: !167, isLocal: false, isDefinition: true, variable: float* @camera.2)
!167 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !161, size: 32, align: 4, offset: 64)
!168 = !{i32 2, !"Dwarf Version", i32 4}
!169 = !{i32 2, !"Debug Info Version", i32 3}
!170 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!171 = !{!"RaytracingShader.hlsl", !"\0D\0Astruct Payload\0D\0A{\0D\0A    float3 RayColor;\0D\0A};\0D\0A\0D\0Astruct CameraInfo\0D\0A{\0D\0A    matrix mtxViewProj;\0D\0A    matrix mtxInverseViewProj;\0D\0A    float3 cameraEye;\0D\0A};\0D\0A\0D\0Astruct HasMaterial\0D\0A{\0D\0A    bool bHasAlbedoColor;\0D\0A    bool bHasEmissiveColor;\0D\0A    bool bHasSpecularColor;\0D\0A    bool bHasGlossiness;\0D\0A    bool bHasSmoothness;\0D\0A    bool bHasMetallic;\0D\0A    bool bHasSpecularHighlight;\0D\0A    bool bHasGlossyReflection;\0D\0A    \0D\0A    bool bHasAlbedoMap;\0D\0A    bool bHasSpecularMap;\0D\0A    bool bHasNormalMap;\0D\0A    bool bHasMetallicMap;\0D\0A    bool bHasEmissionMap;\0D\0A    bool bHasDetailAlbedoMap;\0D\0A    bool bHasDetailNormalMap;\0D\0A    \0D\0A    float4 AlbedoColor;\0D\0A    float4 EmissiveColor;\0D\0A    float4 SpecularColor;\0D\0A    float Glossiness;\0D\0A    float Smoothness;\0D\0A    float Metallic;\0D\0A    float SpecularHighlight;\0D\0A    float GlossyReflection;\0D\0A};\0D\0A\0D\0Astruct HasMesh\0D\0A{\0D\0A    bool bHasVertex;\0D\0A    bool bHasColor;\0D\0A    bool bHasTex0;\0D\0A    bool bHasTex1;\0D\0A    bool bHasNormals;\0D\0A    bool bHasTangenrs;\0D\0A    bool bHasBiTangents;\0D\0A    bool bHasSubMeshes;\0D\0A};\0D\0A\0D\0A// Global Root Signature ============================================\0D\0ARaytracingAccelerationStructure g_Scene : register(t0, space0);\0D\0A\0D\0ARWTexture2D<float4> uav : register(u0);\0D\0A\0D\0AConstantBuffer<CameraInfo> g_CameraInfo : register(b0);\0D\0A\0D\0ASamplerState g_Sampler : register(s0);\0D\0A// ==================================================================\0D\0A\0D\0A// Local Root Signature =============================================\0D\0AConstantBuffer<HasMaterial> l_Material : register(b1, space0);\0D\0AConstantBuffer<HasMesh> l_Mesh : register(b1, space1);\0D\0A\0D\0AStructuredBuffer<float3> l_Vertices : register(t1, space0);\0D\0AStructuredBuffer<float4> l_Colors : register(t1, space1);\0D\0AStructuredBuffer<float2> l_Tex0 : register(t1, space2);\0D\0AStructuredBuffer<float2> l_Tex1 : register(t1, space3);\0D\0AStructuredBuffer<float3> l_Normals : register(t1, space4);\0D\0AStructuredBuffer<float3> l_Tangents : register(t1, space5);\0D\0AStructuredBuffer<float3> l_BiTangents : register(t1, space6);\0D\0AStructuredBuffer<uint> l_Indices : register(t1, space7);\0D\0A\0D\0ATexture2D l_AlbedoMap : register(t2, space0);\0D\0ATexture2D l_SpecularMap : register(t2, space1);\0D\0ATexture2D l_NormalMap : register(t2, space2);\0D\0ATexture2D l_MetallicMap : register(t2, space3);\0D\0ATexture2D l_EmissionMap : register(t2, space4);\0D\0ATexture2D l_DetailAlbedoMap : register(t2, space5);\0D\0ATexture2D l_DetailNormalMap : register(t2, space6);\0D\0A// ==================================================================\0D\0A\0D\0Astatic const float3 camera = float3(0, 5, -7);\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid RayGenShader()\0D\0A{\0D\0A    uint2 idx = DispatchRaysIndex().xy;\0D\0A    float2 size = DispatchRaysDimensions().xy;\0D\0A    float2 uv = idx / size;\0D\0A    float3 target = float3((uv.x * 2 - 1) * 1.8 * (size.x / size.y), (1 - uv.y) * 4 - 2 + camera.y, 0);\0D\0A    RayDesc ray;\0D\0A    ray.Origin = camera;\0D\0A    ray.Direction = target - camera;\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 1000;\0D\0A    \0D\0A    Payload payload;\0D\0A    \0D\0A    TraceRay(g_Scene, RAY_FLAG_NONE, 0xFF, 0, 0, 0, ray, payload);\0D\0A    \0D\0A    uav[idx] = float4(payload.RayColor, 1.0f);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid Miss(inout Payload payload)\0D\0A{\0D\0A    payload.RayColor = float3(0.0, 0.8, 1.0);\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ClosestHit(inout Payload payload, BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    float2 uvs[3] = { float2(0.0, 0.0), float2(0.0, 0.0), float2(0.0, 0.0) };\0D\0A    uint index[3];\0D\0A    uint idx;\0D\0A    if (l_Mesh.bHasSubMeshes) {\0D\0A        idx = PrimitiveIndex() * 3;\0D\0A        index[0] = l_Indices[idx];\0D\0A        index[1] = l_Indices[idx + 1];\0D\0A        index[2] = l_Indices[idx + 2];\0D\0A        uvs[0] = l_Tex0[index[0]];\0D\0A        uvs[1] = l_Tex0[index[1]];\0D\0A        uvs[2] = l_Tex0[index[2]];\0D\0A    }\0D\0A    \0D\0A    float2 texCoord = uvs[0] * (1.0f - attrib.barycentrics.x - attrib.barycentrics.y) +\0D\0A    uvs[1] * attrib.barycentrics.x + uvs[2] * attrib.barycentrics.y;\0D\0A    \0D\0A    if (l_Material.bHasAlbedoMap) {\0D\0A        float4 color = l_AlbedoMap.SampleLevel(g_Sampler, texCoord, 0);\0D\0A        payload.RayColor = color.xyz;\0D\0A    }\0D\0A    else\0D\0A    {\0D\0A        payload.RayColor = float3(1.0, 1.0, 0.0);\0D\0A    }\0D\0A}"}
!172 = !{!"RaytracingShader.hlsl"}
!173 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"/Fo", !"C:\5CUsers\5Cjoke\5CDesktop\5CMonster_Chaser\5CMonster_Chaser\5Cx64\5CDebug\5CRaytracingShader.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!174 = !{i32 1, i32 3}
!175 = !{i32 1, i32 6}
!176 = !{!"lib", i32 6, i32 3}
!177 = !{!178, !187, !189, !192}
!178 = !{!179, !181, !183, !185}
!179 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?g_Scene@@3URaytracingAccelerationStructure@@A", !"g_Scene", i32 0, i32 0, i32 1, i32 16, i32 0, !180}
!180 = !{i32 0, i32 4}
!181 = !{i32 1, %"class.StructuredBuffer<vector<float, 2> >"* @"\01?l_Tex0@@3V?$StructuredBuffer@V?$vector@M$01@@@@A", !"l_Tex0", i32 2, i32 1, i32 1, i32 12, i32 0, !182}
!182 = !{i32 1, i32 8}
!183 = !{i32 2, %"class.StructuredBuffer<unsigned int>"* @"\01?l_Indices@@3V?$StructuredBuffer@I@@A", !"l_Indices", i32 7, i32 1, i32 1, i32 12, i32 0, !184}
!184 = !{i32 1, i32 4}
!185 = !{i32 3, %"class.Texture2D<vector<float, 4> >"* @"\01?l_AlbedoMap@@3V?$Texture2D@V?$vector@M$03@@@@A", !"l_AlbedoMap", i32 0, i32 2, i32 1, i32 2, i32 0, !186}
!186 = !{i32 0, i32 9}
!187 = !{!188}
!188 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"uav", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !186}
!189 = !{!190, !191}
!190 = !{i32 0, %l_Material* @l_Material, !"l_Material", i32 0, i32 1, i32 1, i32 132, null}
!191 = !{i32 1, %l_Mesh* @l_Mesh, !"l_Mesh", i32 1, i32 1, i32 1, i32 32, null}
!192 = !{!193}
!193 = !{i32 0, %struct.SamplerState* @"\01?g_Sampler@@3USamplerState@@A", !"g_Sampler", i32 0, i32 0, i32 1, i32 0, null}
!194 = !{i32 0, %struct.RaytracingAccelerationStructure undef, !195, %"class.RWTexture2D<vector<float, 4> >" undef, !197, %struct.CameraInfo undef, !199, %struct.HasMaterial undef, !204, %struct.HasMesh undef, !228, %"class.StructuredBuffer<vector<float, 3> >" undef, !237, %"class.StructuredBuffer<vector<float, 4> >" undef, !197, %"class.StructuredBuffer<vector<float, 2> >" undef, !238, %"class.StructuredBuffer<unsigned int>" undef, !239, %"class.Texture2D<vector<float, 4> >" undef, !241, %"class.Texture2D<vector<float, 4> >::mips_type" undef, !243, %struct.RayDesc undef, !245, %struct.Payload undef, !250, %struct.BuiltInTriangleIntersectionAttributes undef, !252, %l_Material undef, !254, %l_Mesh undef, !256}
!195 = !{i32 4, !196}
!196 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!197 = !{i32 16, !198}
!198 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!199 = !{i32 140, !200, !202, !203}
!200 = !{i32 6, !"mtxViewProj", i32 2, !201, i32 3, i32 0, i32 7, i32 9}
!201 = !{i32 4, i32 4, i32 2}
!202 = !{i32 6, !"mtxInverseViewProj", i32 2, !201, i32 3, i32 64, i32 7, i32 9}
!203 = !{i32 6, !"cameraEye", i32 3, i32 128, i32 7, i32 9}
!204 = !{i32 132, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227}
!205 = !{i32 6, !"bHasAlbedoColor", i32 3, i32 0, i32 7, i32 1}
!206 = !{i32 6, !"bHasEmissiveColor", i32 3, i32 4, i32 7, i32 1}
!207 = !{i32 6, !"bHasSpecularColor", i32 3, i32 8, i32 7, i32 1}
!208 = !{i32 6, !"bHasGlossiness", i32 3, i32 12, i32 7, i32 1}
!209 = !{i32 6, !"bHasSmoothness", i32 3, i32 16, i32 7, i32 1}
!210 = !{i32 6, !"bHasMetallic", i32 3, i32 20, i32 7, i32 1}
!211 = !{i32 6, !"bHasSpecularHighlight", i32 3, i32 24, i32 7, i32 1}
!212 = !{i32 6, !"bHasGlossyReflection", i32 3, i32 28, i32 7, i32 1}
!213 = !{i32 6, !"bHasAlbedoMap", i32 3, i32 32, i32 7, i32 1}
!214 = !{i32 6, !"bHasSpecularMap", i32 3, i32 36, i32 7, i32 1}
!215 = !{i32 6, !"bHasNormalMap", i32 3, i32 40, i32 7, i32 1}
!216 = !{i32 6, !"bHasMetallicMap", i32 3, i32 44, i32 7, i32 1}
!217 = !{i32 6, !"bHasEmissionMap", i32 3, i32 48, i32 7, i32 1}
!218 = !{i32 6, !"bHasDetailAlbedoMap", i32 3, i32 52, i32 7, i32 1}
!219 = !{i32 6, !"bHasDetailNormalMap", i32 3, i32 56, i32 7, i32 1}
!220 = !{i32 6, !"AlbedoColor", i32 3, i32 64, i32 7, i32 9}
!221 = !{i32 6, !"EmissiveColor", i32 3, i32 80, i32 7, i32 9}
!222 = !{i32 6, !"SpecularColor", i32 3, i32 96, i32 7, i32 9}
!223 = !{i32 6, !"Glossiness", i32 3, i32 112, i32 7, i32 9}
!224 = !{i32 6, !"Smoothness", i32 3, i32 116, i32 7, i32 9}
!225 = !{i32 6, !"Metallic", i32 3, i32 120, i32 7, i32 9}
!226 = !{i32 6, !"SpecularHighlight", i32 3, i32 124, i32 7, i32 9}
!227 = !{i32 6, !"GlossyReflection", i32 3, i32 128, i32 7, i32 9}
!228 = !{i32 32, !229, !230, !231, !232, !233, !234, !235, !236}
!229 = !{i32 6, !"bHasVertex", i32 3, i32 0, i32 7, i32 1}
!230 = !{i32 6, !"bHasColor", i32 3, i32 4, i32 7, i32 1}
!231 = !{i32 6, !"bHasTex0", i32 3, i32 8, i32 7, i32 1}
!232 = !{i32 6, !"bHasTex1", i32 3, i32 12, i32 7, i32 1}
!233 = !{i32 6, !"bHasNormals", i32 3, i32 16, i32 7, i32 1}
!234 = !{i32 6, !"bHasTangenrs", i32 3, i32 20, i32 7, i32 1}
!235 = !{i32 6, !"bHasBiTangents", i32 3, i32 24, i32 7, i32 1}
!236 = !{i32 6, !"bHasSubMeshes", i32 3, i32 28, i32 7, i32 1}
!237 = !{i32 12, !198}
!238 = !{i32 8, !198}
!239 = !{i32 4, !240}
!240 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 5}
!241 = !{i32 20, !198, !242}
!242 = !{i32 6, !"mips", i32 3, i32 16}
!243 = !{i32 4, !244}
!244 = !{i32 6, !"handle", i32 3, i32 0, i32 7, i32 5}
!245 = !{i32 32, !246, !247, !248, !249}
!246 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!247 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!248 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!249 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!250 = !{i32 12, !251}
!251 = !{i32 6, !"RayColor", i32 3, i32 0, i32 7, i32 9}
!252 = !{i32 8, !253}
!253 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!254 = !{i32 132, !255}
!255 = !{i32 6, !"l_Material", i32 3, i32 0}
!256 = !{i32 32, !257}
!257 = !{i32 6, !"l_Mesh", i32 3, i32 0}
!258 = !{i32 1, void ()* @"\01?RayGenShader@@YAXXZ", !259, void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z", !261, void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !263}
!259 = !{!260}
!260 = !{i32 1, !2, !2}
!261 = !{!260, !262}
!262 = !{i32 2, !2, !2}
!263 = !{!260, !262, !264}
!264 = !{i32 0, !2, !2}
!265 = !{null, !"", null, !177, !266}
!266 = !{i32 0, i64 65553}
!267 = !{void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !268}
!268 = !{i32 8, i32 10, i32 6, i32 12, i32 7, i32 8, i32 5, !269}
!269 = !{i32 0}
!270 = !{void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z", !"\01?Miss@@YAXUPayload@@@Z", null, null, !271}
!271 = !{i32 8, i32 11, i32 6, i32 12, i32 5, !269}
!272 = !{void ()* @"\01?RayGenShader@@YAXXZ", !"\01?RayGenShader@@YAXXZ", null, null, !273}
!273 = !{i32 8, i32 7, i32 5, !269}
!274 = !DILocation(line: 104, column: 5, scope: !32)
!275 = !DILocation(line: 106, column: 5, scope: !32)
!276 = !DILocation(line: 92, column: 17, scope: !32)
!277 = !DILocation(line: 92, column: 11, scope: !32)
!278 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !32, file: !1, line: 92, type: !279)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 92, baseType: !280)
!280 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 92, size: 64, align: 32, elements: !281, templateParams: !284)
!281 = !{!282, !283}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !280, file: !1, line: 92, baseType: !51, size: 32, align: 32, flags: DIFlagPublic)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !280, file: !1, line: 92, baseType: !51, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!284 = !{!151, !30}
!285 = !DIExpression(DW_OP_bit_piece, 0, 32)
!286 = !DIExpression(DW_OP_bit_piece, 32, 32)
!287 = !DILocation(line: 93, column: 19, scope: !32)
!288 = !DILocation(line: 93, column: 12, scope: !32)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !32, file: !1, line: 93, type: !24)
!290 = !DILocation(line: 94, column: 17, scope: !32)
!291 = !DILocation(line: 94, column: 21, scope: !32)
!292 = !DILocation(line: 94, column: 12, scope: !32)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv", scope: !32, file: !1, line: 94, type: !24)
!294 = !DILocation(line: 95, column: 34, scope: !32)
!295 = !DILocation(line: 95, column: 38, scope: !32)
!296 = !DILocation(line: 95, column: 43, scope: !32)
!297 = !DILocation(line: 95, column: 59, scope: !32)
!298 = !DILocation(line: 95, column: 49, scope: !32)
!299 = !DILocation(line: 95, column: 73, scope: !32)
!300 = !DILocation(line: 95, column: 81, scope: !32)
!301 = !DILocation(line: 95, column: 85, scope: !32)
!302 = !DILocation(line: 95, column: 91, scope: !32)
!303 = !DILocation(line: 95, column: 89, scope: !32)
!304 = !DILocation(line: 95, column: 12, scope: !32)
!305 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "target", scope: !32, file: !1, line: 95, type: !4)
!306 = !DIExpression(DW_OP_bit_piece, 64, 32)
!307 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !32, file: !1, line: 96, type: !308)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 96, size: 256, align: 32, elements: !309)
!309 = !{!310, !311, !312, !313}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !308, file: !1, line: 96, baseType: !5, size: 96, align: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !308, file: !1, line: 96, baseType: !8, size: 32, align: 32, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !308, file: !1, line: 96, baseType: !5, size: 96, align: 32, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !308, file: !1, line: 96, baseType: !8, size: 32, align: 32, offset: 224)
!314 = !DIExpression()
!315 = !DILocation(line: 96, column: 13, scope: !32)
!316 = !DILocation(line: 97, column: 18, scope: !32)
!317 = !DILocation(line: 97, column: 9, scope: !32)
!318 = !DILocation(line: 97, column: 16, scope: !32)
!319 = !DILocation(line: 98, column: 30, scope: !32)
!320 = !DILocation(line: 98, column: 28, scope: !32)
!321 = !DILocation(line: 98, column: 9, scope: !32)
!322 = !DILocation(line: 98, column: 19, scope: !32)
!323 = !DILocation(line: 99, column: 9, scope: !32)
!324 = !DILocation(line: 99, column: 14, scope: !32)
!325 = !DILocation(line: 100, column: 9, scope: !32)
!326 = !DILocation(line: 100, column: 14, scope: !32)
!327 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !32, file: !1, line: 102, type: !39)
!328 = !DILocation(line: 102, column: 13, scope: !32)
!329 = !DILocation(line: 106, column: 31, scope: !32)
!330 = !DILocation(line: 106, column: 23, scope: !32)
!331 = !DILocation(line: 106, column: 14, scope: !32)
!332 = !DILocation(line: 107, column: 1, scope: !32)
!333 = !DILocation(line: 112, column: 22, scope: !35)
!334 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !35, file: !1, line: 110, type: !39)
!335 = !DILocation(line: 110, column: 25, scope: !35)
!336 = !DILocation(line: 113, column: 1, scope: !35)
!337 = !DILocation(line: 135, column: 24, scope: !338)
!338 = distinct !DILexicalBlock(scope: !339, file: !1, line: 134, column: 35)
!339 = distinct !DILexicalBlock(scope: !42, file: !1, line: 134, column: 9)
!340 = !DILocation(line: 123, column: 20, scope: !341)
!341 = distinct !DILexicalBlock(scope: !342, file: !1, line: 121, column: 31)
!342 = distinct !DILexicalBlock(scope: !42, file: !1, line: 121, column: 9)
!343 = !DILocation(line: 126, column: 18, scope: !341)
!344 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attrib", arg: 2, scope: !42, file: !1, line: 116, type: !45)
!345 = !DILocation(line: 116, column: 78, scope: !42)
!346 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uvs", scope: !42, file: !1, line: 118, type: !347)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 192, align: 32, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 3)
!350 = !DILocation(line: 118, column: 12, scope: !42)
!351 = !{i32 0, i32 64, i32 3}
!352 = !{i32 32, i32 64, i32 3}
!353 = !DILocation(line: 118, column: 21, scope: !42)
!354 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !42, file: !1, line: 119, type: !355)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 96, align: 32, elements: !348)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 119, baseType: !51)
!357 = !DILocation(line: 119, column: 10, scope: !42)
!358 = !DILocation(line: 121, column: 16, scope: !342)
!359 = !DILocation(line: 121, column: 9, scope: !42)
!360 = !DILocation(line: 122, column: 15, scope: !341)
!361 = !DILocation(line: 122, column: 32, scope: !341)
!362 = !DILocation(line: 122, column: 13, scope: !341)
!363 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !42, file: !1, line: 120, type: !356)
!364 = !DILocation(line: 120, column: 10, scope: !42)
!365 = !DILocation(line: 123, column: 9, scope: !341)
!366 = !DILocation(line: 123, column: 18, scope: !341)
!367 = !DILocation(line: 124, column: 34, scope: !341)
!368 = !DILocation(line: 124, column: 20, scope: !341)
!369 = !DILocation(line: 124, column: 9, scope: !341)
!370 = !DILocation(line: 124, column: 18, scope: !341)
!371 = !DILocation(line: 125, column: 34, scope: !341)
!372 = !DILocation(line: 125, column: 20, scope: !341)
!373 = !DILocation(line: 125, column: 9, scope: !341)
!374 = !DILocation(line: 125, column: 18, scope: !341)
!375 = !DILocation(line: 126, column: 25, scope: !341)
!376 = !DILocation(line: 126, column: 9, scope: !341)
