#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: 7e50e21e54da8a52a0da6700649a3ebb.pdb
; shader hash: 7e50e21e54da8a52a0da6700649a3ebb
;
; Buffer Definitions:
;
; cbuffer g_CameraInfo
; {
;
;   struct g_CameraInfo
;   {
;
;       struct struct.CameraInfo
;       {
;
;           column_major float4x4 mtxViewProj;        ; Offset:    0
;           column_major float4x4 mtxInverseViewProj; ; Offset:   64
;           float3 cameraEye;                         ; Offset:  128
;           int bNormalMapping;                       ; Offset:  140
;       
;       } g_CameraInfo;                               ; Offset:    0
;
;   
;   } g_CameraInfo;                                   ; Offset:    0 Size:   144
;
; }
;
; cbuffer g_Lights
; {
;
;   struct g_Lights
;   {
;
;       struct struct.Lights
;       {
;
;           uint numLights;                           ; Offset:    0
;           float3 padding;                           ; Offset:    4
;           struct struct.Light
;           {
;
;               uint Type;                            ; Offset:   16
;               float3 Position;                      ; Offset:   20
;               float Intensity;                      ; Offset:   32
;               float3 Direction;                     ; Offset:   36
;               float Range;                          ; Offset:   48
;               float SpotAngle;                      ; Offset:   52

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !134)
!1 = !DIFile(filename: "PBR_RayTracing.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !22, !31, !39}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 222, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 222, size: 288, align: 32, elements: !6, templateParams: !17)
!6 = !{!7, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !5, file: !1, line: 222, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !5, file: !1, line: 222, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !5, file: !1, line: 222, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !5, file: !1, line: 222, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !5, file: !1, line: 222, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !5, file: !1, line: 222, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !5, file: !1, line: 222, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !5, file: !1, line: 222, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !5, file: !1, line: 222, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!17 = !{!18, !19, !21}
!18 = !DITemplateTypeParameter(name: "element", type: !8)
!19 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 3)
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 225, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 225, size: 128, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !26, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 225, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 225, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 225, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, line: 225, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !{!18, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 4)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 150, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 150, size: 96, align: 32, elements: !33, templateParams: !37)
!33 = !{!34, !35, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !32, file: !1, line: 150, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !32, file: !1, line: 150, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !32, file: !1, line: 150, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!37 = !{!18, !38}
!38 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 3)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !41, templateParams: !44)
!41 = !{!42, !43}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !40, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !40, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !{!18, !45}
!45 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 2)
!46 = !{!47, !56, !61, !62, !63, !66, !69, !72, !81, !85, !93, !96, !99, !102, !109, !115, !116, !119, !122, !125, !128, !131}
!47 = !DISubprogram(name: "GetTex0FromBuffer", linkageName: "\01?GetTex0FromBuffer@@YAXY02$$CAV?$vector@M$01@@I@Z", scope: !1, file: !1, line: 135, type: !48, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !50, !54}
!50 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !51)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 192, align: 32, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 3)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !55)
!55 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!56 = !DISubprogram(name: "GetNormalFromBuffer", linkageName: "\01?GetNormalFromBuffer@@YAXY02$$CAV?$vector@M$02@@I@Z", scope: !1, file: !1, line: 152, type: !57, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: false)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !59, !54}
!59 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !60)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 288, align: 32, elements: !52)
!61 = !DISubprogram(name: "GetTangentFromBuffer", linkageName: "\01?GetTangentFromBuffer@@YAXY02$$CAV?$vector@M$02@@I@Z", scope: !1, file: !1, line: 169, type: !57, isLocal: false, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: false)
!62 = !DISubprogram(name: "GetBiTangentFromBuffer", linkageName: "\01?GetBiTangentFromBuffer@@YAXY02$$CAV?$vector@M$02@@I@Z", scope: !1, file: !1, line: 186, type: !57, isLocal: false, isDefinition: true, scopeLine: 187, flags: DIFlagPrototyped, isOptimized: false)
!63 = !DISubprogram(name: "GetInterpolationHitFloat2", linkageName: "\01?GetInterpolationHitFloat2@@YA?AV?$vector@M$01@@Y02V1@V1@@Z", scope: !1, file: !1, line: 208, type: !64, isLocal: false, isDefinition: true, scopeLine: 209, flags: DIFlagPrototyped, isOptimized: false)
!64 = !DISubroutineType(types: !65)
!65 = !{!39, !51, !39}
!66 = !DISubprogram(name: "GetInterpolationHitFloat3", linkageName: "\01?GetInterpolationHitFloat3@@YA?AV?$vector@M$02@@Y02V1@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 214, type: !67, isLocal: false, isDefinition: true, scopeLine: 215, flags: DIFlagPrototyped, isOptimized: false)
!67 = !DISubroutineType(types: !68)
!68 = !{!31, !60, !39}
!69 = !DISubprogram(name: "GetHitNormalFromNormalMap", linkageName: "\01?GetHitNormalFromNormalMap@@YA?AV?$vector@M$02@@V1@00V?$vector@M$01@@@Z", scope: !1, file: !1, line: 220, type: !70, isLocal: false, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped, isOptimized: false)
!70 = !DISubroutineType(types: !71)
!71 = !{!31, !31, !31, !31, !39}
!72 = !DISubprogram(name: "TraceRadianceRay", linkageName: "\01?TraceRadianceRay@@YA?AV?$vector@M$03@@URayDesc@@I@Z", scope: !1, file: !1, line: 227, type: !73, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: false)
!73 = !DISubroutineType(types: !74)
!74 = !{!22, !75, !54}
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 225, size: 256, align: 32, elements: !76)
!76 = !{!77, !78, !79, !80}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !75, file: !1, line: 225, baseType: !32, size: 96, align: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !75, file: !1, line: 225, baseType: !8, size: 32, align: 32, offset: 96)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !75, file: !1, line: 225, baseType: !32, size: 96, align: 32, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !75, file: !1, line: 225, baseType: !8, size: 32, align: 32, offset: 224)
!81 = !DISubprogram(name: "CheckTheShadow", linkageName: "\01?CheckTheShadow@@YA_NURayDesc@@I@Z", scope: !1, file: !1, line: 268, type: !82, isLocal: false, isDefinition: true, scopeLine: 269, flags: DIFlagPrototyped, isOptimized: false)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !75, !54}
!84 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!85 = !DISubprogram(name: "CalculateLighting", linkageName: "\01?CalculateLighting@@YA?AV?$vector@M$02@@URadiancePayload@@V1@M11@Z", scope: !1, file: !1, line: 296, type: !86, isLocal: false, isDefinition: true, scopeLine: 297, flags: DIFlagPrototyped, isOptimized: false)
!86 = !DISubroutineType(types: !87)
!87 = !{!31, !88, !31, !8, !31, !31}
!88 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !89)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "RadiancePayload", file: !1, line: 22, size: 160, align: 32, elements: !90)
!90 = !{!91, !92}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "RayColor", scope: !89, file: !1, line: 24, baseType: !22, size: 128, align: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "RayDepth", scope: !89, file: !1, line: 25, baseType: !54, size: 32, align: 32, offset: 128)
!93 = !DISubprogram(name: "CalculateFinalColor", linkageName: "\01?CalculateFinalColor@@YA?AV?$vector@M$03@@URadiancePayload@@V?$vector@M$02@@IV?$vector@M$01@@@Z", scope: !1, file: !1, line: 344, type: !94, isLocal: false, isDefinition: true, scopeLine: 345, flags: DIFlagPrototyped, isOptimized: false)
!94 = !DISubroutineType(types: !95)
!95 = !{!22, !88, !31, !54, !39}
!96 = !DISubprogram(name: "RayGenShader", linkageName: "\01?RayGenShader@@YAXXZ", scope: !1, file: !1, line: 391, type: !97, isLocal: false, isDefinition: true, scopeLine: 392, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGenShader@@YAXXZ")
!97 = !DISubroutineType(types: !98)
!98 = !{null}
!99 = !DISubprogram(name: "RadianceMiss", linkageName: "\01?RadianceMiss@@YAXURadiancePayload@@@Z", scope: !1, file: !1, line: 412, type: !100, isLocal: false, isDefinition: true, scopeLine: 413, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RadiancePayload*)* @"\01?RadianceMiss@@YAXURadiancePayload@@@Z")
!100 = !DISubroutineType(types: !101)
!101 = !{null, !88}
!102 = !DISubprogram(name: "ShadowMiss", linkageName: "\01?ShadowMiss@@YAXUShadowPayload@@@Z", scope: !1, file: !1, line: 426, type: !103, isLocal: false, isDefinition: true, scopeLine: 427, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.ShadowPayload*)* @"\01?ShadowMiss@@YAXUShadowPayload@@@Z")
!103 = !DISubroutineType(types: !104)
!104 = !{null, !105}
!105 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !106)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "ShadowPayload", file: !1, line: 28, size: 32, align: 32, elements: !107)
!107 = !{!108}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "bShadow", scope: !106, file: !1, line: 30, baseType: !84, size: 32, align: 32)
!109 = !DISubprogram(name: "RadianceAnyHit", linkageName: "\01?RadianceAnyHit@@YAXURadiancePayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 432, type: !110, isLocal: false, isDefinition: true, scopeLine: 433, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RadiancePayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?RadianceAnyHit@@YAXURadiancePayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!110 = !DISubroutineType(types: !111)
!111 = !{null, !88, !112}
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 429, size: 64, align: 32, elements: !113)
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !112, file: !1, line: 429, baseType: !40, size: 64, align: 32)
!115 = !DISubprogram(name: "RadianceClosestHit", linkageName: "\01?RadianceClosestHit@@YAXURadiancePayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 459, type: !110, isLocal: false, isDefinition: true, scopeLine: 460, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RadiancePayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?RadianceClosestHit@@YAXURadiancePayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!116 = !DISubprogram(name: "ShadowClosestHit", linkageName: "\01?ShadowClosestHit@@YAXUShadowPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 504, type: !117, isLocal: false, isDefinition: true, scopeLine: 505, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.ShadowPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ShadowClosestHit@@YAXUShadowPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!117 = !DISubroutineType(types: !118)
!118 = !{null, !105, !112}
!119 = !DISubprogram(name: "CalculateCookTorranceSpecular", linkageName: "\01?CalculateCookTorranceSpecular@@YA?AV?$vector@M$02@@MV1@MMM@Z", scope: !1, file: !1, line: 287, type: !120, isLocal: false, isDefinition: true, scopeLine: 288, flags: DIFlagPrototyped, isOptimized: false)
!120 = !DISubroutineType(types: !121)
!121 = !{!31, !8, !31, !8, !8, !8}
!122 = !DISubprogram(name: "GetFresnelusingSchlick", linkageName: "\01?GetFresnelusingSchlick@@YA?AV?$vector@M$02@@V1@M@Z", scope: !1, file: !1, line: 247, type: !123, isLocal: false, isDefinition: true, scopeLine: 248, flags: DIFlagPrototyped, isOptimized: false)
!123 = !DISubroutineType(types: !124)
!124 = !{!31, !31, !8}
!125 = !DISubprogram(name: "D_GGX", linkageName: "\01?D_GGX@@YAMMM@Z", scope: !1, file: !1, line: 252, type: !126, isLocal: false, isDefinition: true, scopeLine: 253, flags: DIFlagPrototyped, isOptimized: false)
!126 = !DISubroutineType(types: !127)
!127 = !{!8, !8, !8}
!128 = !DISubprogram(name: "GetSmithGeometry", linkageName: "\01?GetSmithGeometry@@YA?AV?$vector@M$02@@MMM@Z", scope: !1, file: !1, line: 259, type: !129, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: false)
!129 = !DISubroutineType(types: !130)
!130 = !{!31, !8, !8, !8}
!131 = !DISubprogram(name: "GetWorldPosition", linkageName: "\01?GetWorldPosition@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 203, type: !132, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: false)
!132 = !DISubroutineType(types: !133)
!133 = !{!31}
!134 = !{!135, !137, !138, !140, !144, !175, !197, !199, !228, !242, !246, !248, !252, !253, !254, !255, !256, !260, !262, !263, !264, !265, !266, !267}
!135 = !DIGlobalVariable(name: "RAY_FLAG_CULL_BACK_FACING_TRIANGLES", scope: !0, file: !1, line: 236, type: !136, isLocal: true, isDefinition: true, variable: i32 16)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!137 = !DIGlobalVariable(name: "RAY_FLAG_FORCE_OPAQUE", scope: !0, file: !1, line: 277, type: !136, isLocal: true, isDefinition: true, variable: i32 1)
!138 = !DIGlobalVariable(name: "g_Scene", linkageName: "\01?g_Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 103, type: !139, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?g_Scene@@3URaytracingAccelerationStructure@@A")
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 103, size: 32, align: 32, elements: !2)
!140 = !DIGlobalVariable(name: "uav", linkageName: "\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 105, type: !141, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!141 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 105, size: 128, align: 32, elements: !2, templateParams: !142)
!142 = !{!143}
!143 = !DITemplateTypeParameter(name: "element", type: !23)
!144 = !DIGlobalVariable(name: "g_CameraInfo", linkageName: "\01?g_CameraInfo@@3U?$ConstantBuffer@UCameraInfo@@@@A", scope: !0, file: !1, line: 107, type: !145, isLocal: false, isDefinition: true)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<CameraInfo>", file: !1, line: 107, size: 32, align: 32, elements: !2, templateParams: !146)
!146 = !{!147}
!147 = !DITemplateTypeParameter(name: "T", type: !148)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "CameraInfo", file: !1, line: 33, size: 1152, align: 32, elements: !149)
!149 = !{!150, !172, !173, !174}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "mtxViewProj", scope: !148, file: !1, line: 35, baseType: !151, size: 512, align: 32)
!151 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 107, size: 512, align: 32, elements: !152, templateParams: !169)
!152 = !{!153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !151, file: !1, line: 107, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !151, file: !1, line: 107, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !151, file: !1, line: 107, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !151, file: !1, line: 107, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !151, file: !1, line: 107, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !151, file: !1, line: 107, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !151, file: !1, line: 107, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !151, file: !1, line: 107, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !151, file: !1, line: 107, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !151, file: !1, line: 107, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !151, file: !1, line: 107, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !151, file: !1, line: 107, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !151, file: !1, line: 107, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !151, file: !1, line: 107, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !151, file: !1, line: 107, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !151, file: !1, line: 107, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!169 = !{!18, !170, !171}
!170 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 4)
!171 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 4)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "mtxInverseViewProj", scope: !148, file: !1, line: 36, baseType: !151, size: 512, align: 32, offset: 512)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "cameraEye", scope: !148, file: !1, line: 37, baseType: !31, size: 96, align: 32, offset: 1024)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "bNormalMapping", scope: !148, file: !1, line: 38, baseType: !20, size: 32, align: 32, offset: 1120)
!175 = !DIGlobalVariable(name: "g_Lights", linkageName: "\01?g_Lights@@3U?$ConstantBuffer@ULights@@@@A", scope: !0, file: !1, line: 108, type: !176, isLocal: false, isDefinition: true)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<Lights>", file: !1, line: 108, size: 32, align: 32, elements: !2, templateParams: !177)
!177 = !{!178}
!178 = !DITemplateTypeParameter(name: "T", type: !179)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lights", file: !1, line: 95, size: 32896, align: 32, elements: !180)
!180 = !{!181, !182, !183}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "numLights", scope: !179, file: !1, line: 97, baseType: !54, size: 32, align: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !179, file: !1, line: 98, baseType: !31, size: 96, align: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "lights", scope: !179, file: !1, line: 99, baseType: !184, size: 32768, align: 32, offset: 128)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 32768, align: 32, elements: !195)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light", file: !1, line: 83, size: 512, align: 32, elements: !186)
!186 = !{!187, !188, !189, !190, !191, !192, !193, !194}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !185, file: !1, line: 85, baseType: !54, size: 32, align: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !185, file: !1, line: 86, baseType: !31, size: 96, align: 32, offset: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Intensity", scope: !185, file: !1, line: 87, baseType: !8, size: 32, align: 32, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !185, file: !1, line: 88, baseType: !31, size: 96, align: 32, offset: 160)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Range", scope: !185, file: !1, line: 89, baseType: !8, size: 32, align: 32, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "SpotAngle", scope: !185, file: !1, line: 90, baseType: !8, size: 32, align: 32, offset: 288)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !185, file: !1, line: 91, baseType: !39, size: 64, align: 32, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !185, file: !1, line: 92, baseType: !22, size: 128, align: 32, offset: 384)
!195 = !{!196}
!196 = !DISubrange(count: 64)
!197 = !DIGlobalVariable(name: "g_Sampler", linkageName: "\01?g_Sampler@@3USamplerState@@A", scope: !0, file: !1, line: 110, type: !198, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?g_Sampler@@3USamplerState@@A")
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 110, size: 32, align: 32, elements: !2)
!199 = !DIGlobalVariable(name: "l_Material", linkageName: "\01?l_Material@@3U?$ConstantBuffer@UHasMaterial@@@@A", scope: !0, file: !1, line: 114, type: !200, isLocal: false, isDefinition: true)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<HasMaterial>", file: !1, line: 114, size: 32, align: 32, elements: !2, templateParams: !201)
!201 = !{!202}
!202 = !DITemplateTypeParameter(name: "T", type: !203)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "HasMaterial", file: !1, line: 42, size: 1024, align: 32, elements: !204)
!204 = !{!205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "bHasAlbedoColor", scope: !203, file: !1, line: 44, baseType: !20, size: 32, align: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "bHasEmissiveColor", scope: !203, file: !1, line: 45, baseType: !20, size: 32, align: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSpecularColor", scope: !203, file: !1, line: 46, baseType: !20, size: 32, align: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "bHasGlossiness", scope: !203, file: !1, line: 47, baseType: !20, size: 32, align: 32, offset: 96)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSmoothness", scope: !203, file: !1, line: 48, baseType: !20, size: 32, align: 32, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "bHasMetallic", scope: !203, file: !1, line: 49, baseType: !20, size: 32, align: 32, offset: 160)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSpecularHighlight", scope: !203, file: !1, line: 50, baseType: !20, size: 32, align: 32, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "bHasGlossyReflection", scope: !203, file: !1, line: 51, baseType: !20, size: 32, align: 32, offset: 224)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "bHasAlbedoMap", scope: !203, file: !1, line: 53, baseType: !20, size: 32, align: 32, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSpecularMap", scope: !203, file: !1, line: 54, baseType: !20, size: 32, align: 32, offset: 288)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "bHasNormalMap", scope: !203, file: !1, line: 55, baseType: !20, size: 32, align: 32, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "bHasMetallicMap", scope: !203, file: !1, line: 56, baseType: !20, size: 32, align: 32, offset: 352)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "bHasEmissionMap", scope: !203, file: !1, line: 57, baseType: !20, size: 32, align: 32, offset: 384)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "bHasDetailAlbedoMap", scope: !203, file: !1, line: 58, baseType: !20, size: 32, align: 32, offset: 416)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "bHasDetailNormalMap", scope: !203, file: !1, line: 59, baseType: !20, size: 32, align: 32, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Glossiness", scope: !203, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 480)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "AlbedoColor", scope: !203, file: !1, line: 62, baseType: !22, size: 128, align: 32, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "EmissiveColor", scope: !203, file: !1, line: 63, baseType: !22, size: 128, align: 32, offset: 640)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "SpecularColor", scope: !203, file: !1, line: 64, baseType: !22, size: 128, align: 32, offset: 768)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Smoothness", scope: !203, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 896)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !203, file: !1, line: 66, baseType: !8, size: 32, align: 32, offset: 928)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "SpecularHighlight", scope: !203, file: !1, line: 67, baseType: !8, size: 32, align: 32, offset: 960)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "GlossyReflection", scope: !203, file: !1, line: 68, baseType: !8, size: 32, align: 32, offset: 992)
!228 = !DIGlobalVariable(name: "l_Mesh", linkageName: "\01?l_Mesh@@3U?$ConstantBuffer@UHasMesh@@@@A", scope: !0, file: !1, line: 115, type: !229, isLocal: false, isDefinition: true)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<HasMesh>", file: !1, line: 115, size: 32, align: 32, elements: !2, templateParams: !230)
!230 = !{!231}
!231 = !DITemplateTypeParameter(name: "T", type: !232)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "HasMesh", file: !1, line: 71, size: 256, align: 32, elements: !233)
!233 = !{!234, !235, !236, !237, !238, !239, !240, !241}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "bHasVertex", scope: !232, file: !1, line: 73, baseType: !20, size: 32, align: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "bHasColor", scope: !232, file: !1, line: 74, baseType: !20, size: 32, align: 32, offset: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "bHasTex0", scope: !232, file: !1, line: 75, baseType: !20, size: 32, align: 32, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bHasTex1", scope: !232, file: !1, line: 76, baseType: !20, size: 32, align: 32, offset: 96)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "bHasNormals", scope: !232, file: !1, line: 77, baseType: !20, size: 32, align: 32, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "bHasTangenrs", scope: !232, file: !1, line: 78, baseType: !20, size: 32, align: 32, offset: 160)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "bHasBiTangents", scope: !232, file: !1, line: 79, baseType: !20, size: 32, align: 32, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSubMeshes", scope: !232, file: !1, line: 80, baseType: !20, size: 32, align: 32, offset: 224)
!242 = !DIGlobalVariable(name: "l_Vertices", linkageName: "\01?l_Vertices@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 117, type: !243, isLocal: false, isDefinition: true)
!243 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 3> >", file: !1, line: 117, size: 96, align: 32, elements: !2, templateParams: !244)
!244 = !{!245}
!245 = !DITemplateTypeParameter(name: "element", type: !32)
!246 = !DIGlobalVariable(name: "l_Colors", linkageName: "\01?l_Colors@@3V?$StructuredBuffer@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 118, type: !247, isLocal: false, isDefinition: true)
!247 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 4> >", file: !1, line: 118, size: 128, align: 32, elements: !2, templateParams: !142)
!248 = !DIGlobalVariable(name: "l_Tex0", linkageName: "\01?l_Tex0@@3V?$StructuredBuffer@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 119, type: !249, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<vector<float, 2> >"* @"\01?l_Tex0@@3V?$StructuredBuffer@V?$vector@M$01@@@@A")
!249 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 2> >", file: !1, line: 119, size: 64, align: 32, elements: !2, templateParams: !250)
!250 = !{!251}
!251 = !DITemplateTypeParameter(name: "element", type: !40)
!252 = !DIGlobalVariable(name: "l_Tex1", linkageName: "\01?l_Tex1@@3V?$StructuredBuffer@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 120, type: !249, isLocal: false, isDefinition: true)
!253 = !DIGlobalVariable(name: "l_Normals", linkageName: "\01?l_Normals@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 121, type: !243, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<vector<float, 3> >"* @"\01?l_Normals@@3V?$StructuredBuffer@V?$vector@M$02@@@@A")
!254 = !DIGlobalVariable(name: "l_Tangents", linkageName: "\01?l_Tangents@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 122, type: !243, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<vector<float, 3> >"* @"\01?l_Tangents@@3V?$StructuredBuffer@V?$vector@M$02@@@@A")
!255 = !DIGlobalVariable(name: "l_BiTangents", linkageName: "\01?l_BiTangents@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 123, type: !243, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<vector<float, 3> >"* @"\01?l_BiTangents@@3V?$StructuredBuffer@V?$vector@M$02@@@@A")
!256 = !DIGlobalVariable(name: "l_Indices", linkageName: "\01?l_Indices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 124, type: !257, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<unsigned int>"* @"\01?l_Indices@@3V?$StructuredBuffer@I@@A")
!257 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 124, size: 32, align: 32, elements: !2, templateParams: !258)
!258 = !{!259}
!259 = !DITemplateTypeParameter(name: "element", type: !55)
!260 = !DIGlobalVariable(name: "l_AlbedoMap", linkageName: "\01?l_AlbedoMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 126, type: !261, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?l_AlbedoMap@@3V?$Texture2D@V?$vector@M$03@@@@A")
!261 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 126, size: 160, align: 32, elements: !2, templateParams: !142)
!262 = !DIGlobalVariable(name: "l_SpecularMap", linkageName: "\01?l_SpecularMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 127, type: !261, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?l_SpecularMap@@3V?$Texture2D@V?$vector@M$03@@@@A")
