#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: 9e96a62f5ae9885fdb0ef0abc4e081c4.pdb
; shader hash: 9e96a62f5ae9885fdb0ef0abc4e081c4
;
; Buffer Definitions:
;
; cbuffer g_CameraInfo
; {
;
;   struct g_CameraInfo
;   {
;
;       struct struct.CameraInfo
;       {
;
;           column_major float4x4 mtxViewProj;        ; Offset:    0
;           column_major float4x4 mtxInverseViewProj; ; Offset:   64
;           float3 cameraEye;                         ; Offset:  128
;       
;       } g_CameraInfo;                               ; Offset:    0
;
;   
;   } g_CameraInfo;                                   ; Offset:    0 Size:   140
;
; }
;
; cbuffer l_Material
; {
;
;   struct l_Material
;   {
;
;       struct struct.HasMaterial
;       {
;
;           bool bHasAlbedoColor;                     ; Offset:    0
;           bool bHasEmissiveColor;                   ; Offset:    4
;           bool bHasSpecularColor;                   ; Offset:    8
;           bool bHasGlossiness;                      ; Offset:   12
;           bool bHasSmoothness;                      ; Offset:   16
;           bool bHasMetallic;                        ; Offset:   20
;           bool bHasSpecularHighlight;               ; Offset:   24
;           bool bHasGlossyReflection;                ; Offset:   28
;           bool bHasAlbedoMap;                       ; Offset:   32

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !48)
!1 = !DIFile(filename: "RaytracingShader.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16, !24}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 94, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 94, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 94, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 94, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 94, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 94, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 103, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 97, size: 96, align: 32, elements: !18, templateParams: !22)
!18 = !{!19, !20, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 97, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 97, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, line: 97, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!13, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 90, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 90, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 90, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 90, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!13, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!31 = !{!32, !35, !42}
!32 = !DISubprogram(name: "RayGenShader", linkageName: "\01?RayGenShader@@YAXXZ", scope: !1, file: !1, line: 88, type: !33, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGenShader@@YAXXZ")
!33 = !DISubroutineType(types: !34)
!34 = !{null}
!35 = !DISubprogram(name: "Miss", linkageName: "\01?Miss@@YAXUPayload@@@Z", scope: !1, file: !1, line: 111, type: !36, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z")
!36 = !DISubroutineType(types: !37)
!37 = !{null, !38}
!38 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "Payload", file: !1, line: 2, size: 96, align: 32, elements: !40)
!40 = !{!41}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "RayColor", scope: !39, file: !1, line: 4, baseType: !16, size: 96, align: 32)
!42 = !DISubprogram(name: "ClosestHit", linkageName: "\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 117, type: !43, isLocal: false, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!43 = !DISubroutineType(types: !44)
!44 = !{null, !38, !45}
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 114, size: 64, align: 32, elements: !46)
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !45, file: !1, line: 114, baseType: !25, size: 64, align: 32)
!48 = !{!49, !52, !54, !58, !88, !90, !120, !134, !138, !140, !144, !145, !146, !147, !148, !152, !154, !155, !156, !157, !158, !159}
!49 = !DIGlobalVariable(name: "RAY_FLAG_NONE", scope: !0, file: !1, line: 105, type: !50, isLocal: true, isDefinition: true, variable: i32 0)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!51 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!52 = !DIGlobalVariable(name: "g_Scene", linkageName: "\01?g_Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 56, type: !53, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?g_Scene@@3URaytracingAccelerationStructure@@A")
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 56, size: 32, align: 32, elements: !2)
!54 = !DIGlobalVariable(name: "uav", linkageName: "\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 58, type: !55, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!55 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 58, size: 128, align: 32, elements: !2, templateParams: !56)
!56 = !{!57}
!57 = !DITemplateTypeParameter(name: "element", type: !5)
!58 = !DIGlobalVariable(name: "g_CameraInfo", linkageName: "\01?g_CameraInfo@@3U?$ConstantBuffer@UCameraInfo@@@@A", scope: !0, file: !1, line: 60, type: !59, isLocal: false, isDefinition: true)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<CameraInfo>", file: !1, line: 60, size: 32, align: 32, elements: !2, templateParams: !60)
!60 = !{!61}
!61 = !DITemplateTypeParameter(name: "T", type: !62)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "CameraInfo", file: !1, line: 7, size: 1120, align: 32, elements: !63)
!63 = !{!64, !86, !87}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "mtxViewProj", scope: !62, file: !1, line: 9, baseType: !65, size: 512, align: 32)
!65 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 60, size: 512, align: 32, elements: !66, templateParams: !83)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !65, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!83 = !{!13, !84, !85}
!84 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!85 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mtxInverseViewProj", scope: !62, file: !1, line: 10, baseType: !65, size: 512, align: 32, offset: 512)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "cameraEye", scope: !62, file: !1, line: 11, baseType: !16, size: 96, align: 32, offset: 1024)
!88 = !DIGlobalVariable(name: "g_Sampler", linkageName: "\01?g_Sampler@@3USamplerState@@A", scope: !0, file: !1, line: 62, type: !89, isLocal: false, isDefinition: true)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 62, size: 32, align: 32, elements: !2)
!90 = !DIGlobalVariable(name: "l_Material", linkageName: "\01?l_Material@@3U?$ConstantBuffer@UHasMaterial@@@@A", scope: !0, file: !1, line: 66, type: !91, isLocal: false, isDefinition: true)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<HasMaterial>", file: !1, line: 66, size: 32, align: 32, elements: !2, templateParams: !92)
!92 = !{!93}
!93 = !DITemplateTypeParameter(name: "T", type: !94)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "HasMaterial", file: !1, line: 14, size: 1024, align: 32, elements: !95)
!95 = !{!96, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "bHasAlbedoColor", scope: !94, file: !1, line: 16, baseType: !97, size: 32, align: 32)
!97 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "bHasEmissiveColor", scope: !94, file: !1, line: 17, baseType: !97, size: 32, align: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSpecularColor", scope: !94, file: !1, line: 18, baseType: !97, size: 32, align: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "bHasGlossiness", scope: !94, file: !1, line: 19, baseType: !97, size: 32, align: 32, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSmoothness", scope: !94, file: !1, line: 20, baseType: !97, size: 32, align: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "bHasMetallic", scope: !94, file: !1, line: 21, baseType: !97, size: 32, align: 32, offset: 160)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSpecularHighlight", scope: !94, file: !1, line: 22, baseType: !97, size: 32, align: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "bHasGlossyReflection", scope: !94, file: !1, line: 23, baseType: !97, size: 32, align: 32, offset: 224)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "bHasAlbedoMap", scope: !94, file: !1, line: 25, baseType: !97, size: 32, align: 32, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSpecularMap", scope: !94, file: !1, line: 26, baseType: !97, size: 32, align: 32, offset: 288)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "bHasNormalMap", scope: !94, file: !1, line: 27, baseType: !97, size: 32, align: 32, offset: 320)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "bHasMetallicMap", scope: !94, file: !1, line: 28, baseType: !97, size: 32, align: 32, offset: 352)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "bHasEmissionMap", scope: !94, file: !1, line: 29, baseType: !97, size: 32, align: 32, offset: 384)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "bHasDetailAlbedoMap", scope: !94, file: !1, line: 30, baseType: !97, size: 32, align: 32, offset: 416)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "bHasDetailNormalMap", scope: !94, file: !1, line: 31, baseType: !97, size: 32, align: 32, offset: 448)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "AlbedoColor", scope: !94, file: !1, line: 33, baseType: !4, size: 128, align: 32, offset: 480)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "EmissiveColor", scope: !94, file: !1, line: 34, baseType: !4, size: 128, align: 32, offset: 608)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "SpecularColor", scope: !94, file: !1, line: 35, baseType: !4, size: 128, align: 32, offset: 736)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Glossiness", scope: !94, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 864)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "Smoothness", scope: !94, file: !1, line: 37, baseType: !8, size: 32, align: 32, offset: 896)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !94, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 928)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "SpecularHighlight", scope: !94, file: !1, line: 39, baseType: !8, size: 32, align: 32, offset: 960)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "GlossyReflection", scope: !94, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 992)
!120 = !DIGlobalVariable(name: "l_Mesh", linkageName: "\01?l_Mesh@@3U?$ConstantBuffer@UHasMesh@@@@A", scope: !0, file: !1, line: 67, type: !121, isLocal: false, isDefinition: true)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<HasMesh>", file: !1, line: 67, size: 32, align: 32, elements: !2, templateParams: !122)
!122 = !{!123}
!123 = !DITemplateTypeParameter(name: "T", type: !124)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "HasMesh", file: !1, line: 43, size: 256, align: 32, elements: !125)
!125 = !{!126, !127, !128, !129, !130, !131, !132, !133}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "bHasVertex", scope: !124, file: !1, line: 45, baseType: !97, size: 32, align: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "bHasColor", scope: !124, file: !1, line: 46, baseType: !97, size: 32, align: 32, offset: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "bHasTex0", scope: !124, file: !1, line: 47, baseType: !97, size: 32, align: 32, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "bHasTex1", scope: !124, file: !1, line: 48, baseType: !97, size: 32, align: 32, offset: 96)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "bHasNormals", scope: !124, file: !1, line: 49, baseType: !97, size: 32, align: 32, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "bHasTangenrs", scope: !124, file: !1, line: 50, baseType: !97, size: 32, align: 32, offset: 160)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "bHasBiTangents", scope: !124, file: !1, line: 51, baseType: !97, size: 32, align: 32, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "bHasSubMeshes", scope: !124, file: !1, line: 52, baseType: !97, size: 32, align: 32, offset: 224)
!134 = !DIGlobalVariable(name: "l_Vertices", linkageName: "\01?l_Vertices@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 69, type: !135, isLocal: false, isDefinition: true)
!135 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 3> >", file: !1, line: 69, size: 96, align: 32, elements: !2, templateParams: !136)
!136 = !{!137}
!137 = !DITemplateTypeParameter(name: "element", type: !17)
!138 = !DIGlobalVariable(name: "l_Colors", linkageName: "\01?l_Colors@@3V?$StructuredBuffer@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 70, type: !139, isLocal: false, isDefinition: true)
!139 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 4> >", file: !1, line: 70, size: 128, align: 32, elements: !2, templateParams: !56)
!140 = !DIGlobalVariable(name: "l_Tex0", linkageName: "\01?l_Tex0@@3V?$StructuredBuffer@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 71, type: !141, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<vector<float, 2> >"* @"\01?l_Tex0@@3V?$StructuredBuffer@V?$vector@M$01@@@@A")
!141 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<float, 2> >", file: !1, line: 71, size: 64, align: 32, elements: !2, templateParams: !142)
!142 = !{!143}
!143 = !DITemplateTypeParameter(name: "element", type: !25)
!144 = !DIGlobalVariable(name: "l_Tex1", linkageName: "\01?l_Tex1@@3V?$StructuredBuffer@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 72, type: !141, isLocal: false, isDefinition: true)
!145 = !DIGlobalVariable(name: "l_Normals", linkageName: "\01?l_Normals@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 73, type: !135, isLocal: false, isDefinition: true)
!146 = !DIGlobalVariable(name: "l_Tangents", linkageName: "\01?l_Tangents@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 74, type: !135, isLocal: false, isDefinition: true)
!147 = !DIGlobalVariable(name: "l_BiTangents", linkageName: "\01?l_BiTangents@@3V?$StructuredBuffer@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 75, type: !135, isLocal: false, isDefinition: true)
!148 = !DIGlobalVariable(name: "l_Indices", linkageName: "\01?l_Indices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 76, type: !149, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<unsigned int>"* @"\01?l_Indices@@3V?$StructuredBuffer@I@@A")
!149 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 76, size: 32, align: 32, elements: !2, templateParams: !150)
!150 = !{!151}
!151 = !DITemplateTypeParameter(name: "element", type: !51)
!152 = !DIGlobalVariable(name: "l_AlbedoMap", linkageName: "\01?l_AlbedoMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 78, type: !153, isLocal: false, isDefinition: true)
!153 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 78, size: 160, align: 32, elements: !2, templateParams: !56)
!154 = !DIGlobalVariable(name: "l_SpecularMap", linkageName: "\01?l_SpecularMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 79, type: !153, isLocal: false, isDefinition: true)
!155 = !DIGlobalVariable(name: "l_NormalMap", linkageName: "\01?l_NormalMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 80, type: !153, isLocal: false, isDefinition: true)
!156 = !DIGlobalVariable(name: "l_MetallicMap", linkageName: "\01?l_MetallicMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 81, type: !153, isLocal: false, isDefinition: true)
!157 = !DIGlobalVariable(name: "l_EmissionMap", linkageName: "\01?l_EmissionMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 82, type: !153, isLocal: false, isDefinition: true)
!158 = !DIGlobalVariable(name: "l_DetailAlbedoMap", linkageName: "\01?l_DetailAlbedoMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 83, type: !153, isLocal: false, isDefinition: true)
!159 = !DIGlobalVariable(name: "l_DetailNormalMap", linkageName: "\01?l_DetailNormalMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 84, type: !153, isLocal: false, isDefinition: true)
!160 = !{i32 2, !"Dwarf Version", i32 4}
!161 = !{i32 2, !"Debug Info Version", i32 3}
!162 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!163 = !{!"RaytracingShader.hlsl", !"\0D\0Astruct Payload\0D\0A{\0D\0A    float3 RayColor;\0D\0A};\0D\0A\0D\0Astruct CameraInfo\0D\0A{\0D\0A    matrix mtxViewProj;\0D\0A    matrix mtxInverseViewProj;\0D\0A    float3 cameraEye;\0D\0A};\0D\0A\0D\0Astruct HasMaterial\0D\0A{\0D\0A    bool bHasAlbedoColor;\0D\0A    bool bHasEmissiveColor;\0D\0A    bool bHasSpecularColor;\0D\0A    bool bHasGlossiness;\0D\0A    bool bHasSmoothness;\0D\0A    bool bHasMetallic;\0D\0A    bool bHasSpecularHighlight;\0D\0A    bool bHasGlossyReflection;\0D\0A    \0D\0A    bool bHasAlbedoMap;\0D\0A    bool bHasSpecularMap;\0D\0A    bool bHasNormalMap;\0D\0A    bool bHasMetallicMap;\0D\0A    bool bHasEmissionMap;\0D\0A    bool bHasDetailAlbedoMap;\0D\0A    bool bHasDetailNormalMap;\0D\0A    \0D\0A    float4 AlbedoColor;\0D\0A    float4 EmissiveColor;\0D\0A    float4 SpecularColor;\0D\0A    float Glossiness;\0D\0A    float Smoothness;\0D\0A    float Metallic;\0D\0A    float SpecularHighlight;\0D\0A    float GlossyReflection;\0D\0A};\0D\0A\0D\0Astruct HasMesh\0D\0A{\0D\0A    bool bHasVertex;\0D\0A    bool bHasColor;\0D\0A    bool bHasTex0;\0D\0A    bool bHasTex1;\0D\0A    bool bHasNormals;\0D\0A    bool bHasTangenrs;\0D\0A    bool bHasBiTangents;\0D\0A    bool bHasSubMeshes;\0D\0A};\0D\0A\0D\0A// Global Root Signature ============================================\0D\0ARaytracingAccelerationStructure g_Scene : register(t0, space0);\0D\0A\0D\0ARWTexture2D<float4> uav : register(u0);\0D\0A\0D\0AConstantBuffer<CameraInfo> g_CameraInfo : register(b0);\0D\0A\0D\0ASamplerState g_Sampler : register(s0);\0D\0A// ==================================================================\0D\0A\0D\0A// Local Root Signature =============================================\0D\0AConstantBuffer<HasMaterial> l_Material : register(b1, space0);\0D\0AConstantBuffer<HasMesh> l_Mesh : register(b1, space1);\0D\0A\0D\0AStructuredBuffer<float3> l_Vertices : register(t1, space0);\0D\0AStructuredBuffer<float4> l_Colors : register(t1, space1);\0D\0AStructuredBuffer<float2> l_Tex0 : register(t1, space2);\0D\0AStructuredBuffer<float2> l_Tex1 : register(t1, space3);\0D\0AStructuredBuffer<float3> l_Normals : register(t1, space4);\0D\0AStructuredBuffer<float3> l_Tangents : register(t1, space5);\0D\0AStructuredBuffer<float3> l_BiTangents : register(t1, space6);\0D\0AStructuredBuffer<uint> l_Indices : register(t1, space7);\0D\0A\0D\0ATexture2D l_AlbedoMap : register(t2, space0);\0D\0ATexture2D l_SpecularMap : register(t2, space1);\0D\0ATexture2D l_NormalMap : register(t2, space2);\0D\0ATexture2D l_MetallicMap : register(t2, space3);\0D\0ATexture2D l_EmissionMap : register(t2, space4);\0D\0ATexture2D l_DetailAlbedoMap : register(t2, space5);\0D\0ATexture2D l_DetailNormalMap : register(t2, space6);\0D\0A// ==================================================================\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid RayGenShader()\0D\0A{\0D\0A    float2 xy = DispatchRaysIndex().xy + 0.5f;\0D\0A    float2 screenPos = xy / DispatchRaysDimensions().xy * 2.0 - 1.0;\0D\0A    screenPos.y = -screenPos.y;\0D\0A    \0D\0A    float4 world = mul(float4(screenPos, 0, 1), g_CameraInfo.mtxInverseViewProj);\0D\0A    world.xyz /= world.w;\0D\0A    \0D\0A    RayDesc ray;\0D\0A    ray.Origin = g_CameraInfo.cameraEye;\0D\0A    ray.Direction = normalize(world.xyz - ray.Origin);\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 1000;\0D\0A    \0D\0A    Payload payload;\0D\0A    \0D\0A    TraceRay(g_Scene, RAY_FLAG_NONE, 0xFF, 0, 0, 0, ray, payload);\0D\0A    \0D\0A    uav[DispatchRaysIndex().xy] = float4(payload.RayColor, 1.0f);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid Miss(inout Payload payload)\0D\0A{\0D\0A    payload.RayColor = float3(0.0, 0.8, 1.0);\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ClosestHit(inout Payload payload, BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    float2 uvs[3] = { float2(0.0, 0.0), float2(0.0, 0.0), float2(0.0, 0.0) };\0D\0A    uint index[3];\0D\0A    uint idx;\0D\0A    if (l_Mesh.bHasSubMeshes) {\0D\0A        idx = PrimitiveIndex() * 3;\0D\0A        index[0] = l_Indices[idx];\0D\0A        index[1] = l_Indices[idx + 1];\0D\0A        index[2] = l_Indices[idx + 2];\0D\0A        uvs[0] = l_Tex0[index[0]];\0D\0A        uvs[1] = l_Tex0[index[1]];\0D\0A        uvs[2] = l_Tex0[index[2]];\0D\0A    }\0D\0A    \0D\0A    float2 texCoord = uvs[0] * (1.0f - attrib.barycentrics.x - attrib.barycentrics.y) +\0D\0A    uvs[1] * attrib.barycentrics.x + uvs[2] * attrib.barycentrics.y;\0D\0A    \0D\0A    if (l_Material.bHasAlbedoColor) {\0D\0A        //float4 color = l_NormalMap.SampleLevel(g_Sampler, texCoord, 0);\0D\0A        float4 color = float4(0.0, 1.0, 0.5, 1.0);\0D\0A        payload.RayColor = color.xyz;\0D\0A    }\0D\0A    else\0D\0A    {\0D\0A        payload.RayColor = float3(1.0, 1.0, 0.0);\0D\0A    }\0D\0A}"}
!164 = !{!"RaytracingShader.hlsl"}
!165 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"/Fo", !"C:\5CUsers\5Cjoke\5CDesktop\5CMonster_Chaser\5CMonster_Chaser\5Cx64\5CDebug\5CRaytracingShader.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!166 = !{i32 1, i32 3}
!167 = !{i32 1, i32 6}
!168 = !{!"lib", i32 6, i32 3}
!169 = !{!170, !177, !180, null}
!170 = !{!171, !173, !175}
!171 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?g_Scene@@3URaytracingAccelerationStructure@@A", !"g_Scene", i32 0, i32 0, i32 1, i32 16, i32 0, !172}
!172 = !{i32 0, i32 4}
!173 = !{i32 1, %"class.StructuredBuffer<vector<float, 2> >"* @"\01?l_Tex0@@3V?$StructuredBuffer@V?$vector@M$01@@@@A", !"l_Tex0", i32 2, i32 1, i32 1, i32 12, i32 0, !174}
!174 = !{i32 1, i32 8}
!175 = !{i32 2, %"class.StructuredBuffer<unsigned int>"* @"\01?l_Indices@@3V?$StructuredBuffer@I@@A", !"l_Indices", i32 7, i32 1, i32 1, i32 12, i32 0, !176}
!176 = !{i32 1, i32 4}
!177 = !{!178}
!178 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"uav", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !179}
!179 = !{i32 0, i32 9}
!180 = !{!181, !182, !183}
!181 = !{i32 0, %g_CameraInfo* @g_CameraInfo, !"g_CameraInfo", i32 0, i32 0, i32 1, i32 140, null}
!182 = !{i32 1, %l_Material* @l_Material, !"l_Material", i32 0, i32 1, i32 1, i32 132, null}
!183 = !{i32 2, %l_Mesh* @l_Mesh, !"l_Mesh", i32 1, i32 1, i32 1, i32 32, null}
!184 = !{i32 0, %struct.RaytracingAccelerationStructure undef, !185, %"class.RWTexture2D<vector<float, 4> >" undef, !187, %struct.CameraInfo undef, !189, %struct.HasMaterial undef, !194, %struct.HasMesh undef, !218, %"class.StructuredBuffer<vector<float, 3> >" undef, !227, %"class.StructuredBuffer<vector<float, 4> >" undef, !187, %"class.StructuredBuffer<vector<float, 2> >" undef, !228, %"class.StructuredBuffer<unsigned int>" undef, !229, %"class.Texture2D<vector<float, 4> >" undef, !231, %"class.Texture2D<vector<float, 4> >::mips_type" undef, !233, %struct.RayDesc undef, !235, %struct.Payload undef, !240, %struct.BuiltInTriangleIntersectionAttributes undef, !242, %g_CameraInfo undef, !244, %l_Material undef, !246, %l_Mesh undef, !248}
!185 = !{i32 4, !186}
!186 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!187 = !{i32 16, !188}
!188 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!189 = !{i32 140, !190, !192, !193}
!190 = !{i32 6, !"mtxViewProj", i32 2, !191, i32 3, i32 0, i32 7, i32 9}
!191 = !{i32 4, i32 4, i32 2}
!192 = !{i32 6, !"mtxInverseViewProj", i32 2, !191, i32 3, i32 64, i32 7, i32 9}
!193 = !{i32 6, !"cameraEye", i32 3, i32 128, i32 7, i32 9}
!194 = !{i32 132, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217}
!195 = !{i32 6, !"bHasAlbedoColor", i32 3, i32 0, i32 7, i32 1}
!196 = !{i32 6, !"bHasEmissiveColor", i32 3, i32 4, i32 7, i32 1}
!197 = !{i32 6, !"bHasSpecularColor", i32 3, i32 8, i32 7, i32 1}
!198 = !{i32 6, !"bHasGlossiness", i32 3, i32 12, i32 7, i32 1}
!199 = !{i32 6, !"bHasSmoothness", i32 3, i32 16, i32 7, i32 1}
!200 = !{i32 6, !"bHasMetallic", i32 3, i32 20, i32 7, i32 1}
!201 = !{i32 6, !"bHasSpecularHighlight", i32 3, i32 24, i32 7, i32 1}
!202 = !{i32 6, !"bHasGlossyReflection", i32 3, i32 28, i32 7, i32 1}
!203 = !{i32 6, !"bHasAlbedoMap", i32 3, i32 32, i32 7, i32 1}
!204 = !{i32 6, !"bHasSpecularMap", i32 3, i32 36, i32 7, i32 1}
!205 = !{i32 6, !"bHasNormalMap", i32 3, i32 40, i32 7, i32 1}
!206 = !{i32 6, !"bHasMetallicMap", i32 3, i32 44, i32 7, i32 1}
!207 = !{i32 6, !"bHasEmissionMap", i32 3, i32 48, i32 7, i32 1}
!208 = !{i32 6, !"bHasDetailAlbedoMap", i32 3, i32 52, i32 7, i32 1}
!209 = !{i32 6, !"bHasDetailNormalMap", i32 3, i32 56, i32 7, i32 1}
!210 = !{i32 6, !"AlbedoColor", i32 3, i32 64, i32 7, i32 9}
!211 = !{i32 6, !"EmissiveColor", i32 3, i32 80, i32 7, i32 9}
!212 = !{i32 6, !"SpecularColor", i32 3, i32 96, i32 7, i32 9}
!213 = !{i32 6, !"Glossiness", i32 3, i32 112, i32 7, i32 9}
!214 = !{i32 6, !"Smoothness", i32 3, i32 116, i32 7, i32 9}
!215 = !{i32 6, !"Metallic", i32 3, i32 120, i32 7, i32 9}
!216 = !{i32 6, !"SpecularHighlight", i32 3, i32 124, i32 7, i32 9}
!217 = !{i32 6, !"GlossyReflection", i32 3, i32 128, i32 7, i32 9}
!218 = !{i32 32, !219, !220, !221, !222, !223, !224, !225, !226}
!219 = !{i32 6, !"bHasVertex", i32 3, i32 0, i32 7, i32 1}
!220 = !{i32 6, !"bHasColor", i32 3, i32 4, i32 7, i32 1}
!221 = !{i32 6, !"bHasTex0", i32 3, i32 8, i32 7, i32 1}
!222 = !{i32 6, !"bHasTex1", i32 3, i32 12, i32 7, i32 1}
!223 = !{i32 6, !"bHasNormals", i32 3, i32 16, i32 7, i32 1}
!224 = !{i32 6, !"bHasTangenrs", i32 3, i32 20, i32 7, i32 1}
!225 = !{i32 6, !"bHasBiTangents", i32 3, i32 24, i32 7, i32 1}
!226 = !{i32 6, !"bHasSubMeshes", i32 3, i32 28, i32 7, i32 1}
!227 = !{i32 12, !188}
!228 = !{i32 8, !188}
!229 = !{i32 4, !230}
!230 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 5}
!231 = !{i32 20, !188, !232}
!232 = !{i32 6, !"mips", i32 3, i32 16}
!233 = !{i32 4, !234}
!234 = !{i32 6, !"handle", i32 3, i32 0, i32 7, i32 5}
!235 = !{i32 32, !236, !237, !238, !239}
!236 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!237 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!238 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!239 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!240 = !{i32 12, !241}
!241 = !{i32 6, !"RayColor", i32 3, i32 0, i32 7, i32 9}
!242 = !{i32 8, !243}
!243 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!244 = !{i32 140, !245}
!245 = !{i32 6, !"g_CameraInfo", i32 3, i32 0}
!246 = !{i32 132, !247}
!247 = !{i32 6, !"l_Material", i32 3, i32 0}
!248 = !{i32 32, !249}
!249 = !{i32 6, !"l_Mesh", i32 3, i32 0}
!250 = !{i32 1, void ()* @"\01?RayGenShader@@YAXXZ", !251, void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z", !253, void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !255}
!251 = !{!252}
!252 = !{i32 1, !2, !2}
!253 = !{!252, !254}
!254 = !{i32 2, !2, !2}
!255 = !{!252, !254, !256}
!256 = !{i32 0, !2, !2}
!257 = !{null, !"", null, !169, !258}
!258 = !{i32 0, i64 65553}
!259 = !{void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !260}
!260 = !{i32 8, i32 10, i32 6, i32 12, i32 7, i32 8, i32 5, !261}
!261 = !{i32 0}
!262 = !{void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z", !"\01?Miss@@YAXUPayload@@@Z", null, null, !263}
!263 = !{i32 8, i32 11, i32 6, i32 12, i32 5, !261}
!264 = !{void ()* @"\01?RayGenShader@@YAXXZ", !"\01?RayGenShader@@YAXXZ", null, null, !265}
!265 = !{i32 8, i32 7, i32 5, !261}
!266 = !DILocation(line: 105, column: 5, scope: !32)
!267 = !DILocation(line: 107, column: 5, scope: !32)
!268 = !DILocation(line: 90, column: 17, scope: !32)
!269 = !DILocation(line: 90, column: 40, scope: !32)
!270 = !DILocation(line: 90, column: 12, scope: !32)
!271 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xy", scope: !32, file: !1, line: 90, type: !24)
!272 = !DIExpression(DW_OP_bit_piece, 0, 32)
!273 = !DIExpression(DW_OP_bit_piece, 32, 32)
!274 = !DILocation(line: 91, column: 29, scope: !32)
!275 = !DILocation(line: 91, column: 27, scope: !32)
!276 = !DILocation(line: 91, column: 57, scope: !32)
!277 = !DILocation(line: 91, column: 63, scope: !32)
!278 = !DILocation(line: 91, column: 12, scope: !32)
!279 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "screenPos", scope: !32, file: !1, line: 91, type: !24)
!280 = !DILocation(line: 92, column: 19, scope: !32)
!281 = !DILocation(line: 92, column: 17, scope: !32)
!282 = !DILocation(line: 94, column: 62, scope: !32)
!283 = !DILocation(line: 94, column: 20, scope: !32)
!284 = !DILocation(line: 94, column: 12, scope: !32)
!285 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "world", scope: !32, file: !1, line: 94, type: !4)
!286 = !DIExpression(DW_OP_bit_piece, 64, 32)
!287 = !DIExpression(DW_OP_bit_piece, 96, 32)
!288 = !DILocation(line: 95, column: 15, scope: !32)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !32, file: !1, line: 97, type: !290)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 97, size: 256, align: 32, elements: !291)
!291 = !{!292, !293, !294, !295}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !290, file: !1, line: 97, baseType: !17, size: 96, align: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !290, file: !1, line: 97, baseType: !8, size: 32, align: 32, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !290, file: !1, line: 97, baseType: !17, size: 96, align: 32, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !290, file: !1, line: 97, baseType: !8, size: 32, align: 32, offset: 224)
!296 = !DIExpression()
!297 = !DILocation(line: 97, column: 13, scope: !32)
!298 = !DILocation(line: 98, column: 31, scope: !32)
!299 = !DILocation(line: 98, column: 9, scope: !32)
!300 = !DILocation(line: 98, column: 16, scope: !32)
!301 = !DILocation(line: 99, column: 47, scope: !32)
!302 = !DILocation(line: 99, column: 41, scope: !32)
!303 = !DILocation(line: 99, column: 21, scope: !32)
!304 = !DILocation(line: 99, column: 9, scope: !32)
!305 = !DILocation(line: 99, column: 19, scope: !32)
!306 = !DILocation(line: 100, column: 9, scope: !32)
!307 = !DILocation(line: 100, column: 14, scope: !32)
!308 = !DILocation(line: 101, column: 9, scope: !32)
!309 = !DILocation(line: 101, column: 14, scope: !32)
!310 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !32, file: !1, line: 103, type: !39)
!311 = !DILocation(line: 103, column: 13, scope: !32)
!312 = !DILocation(line: 107, column: 50, scope: !32)
!313 = !DILocation(line: 107, column: 42, scope: !32)
!314 = !DILocation(line: 107, column: 9, scope: !32)
!315 = !DILocation(line: 107, column: 33, scope: !32)
!316 = !DILocation(line: 108, column: 1, scope: !32)
!317 = !DILocation(line: 113, column: 22, scope: !35)
!318 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !35, file: !1, line: 111, type: !39)
!319 = !DILocation(line: 111, column: 25, scope: !35)
!320 = !DILocation(line: 114, column: 1, scope: !35)
!321 = !DILocation(line: 124, column: 20, scope: !322)
!322 = distinct !DILexicalBlock(scope: !323, file: !1, line: 122, column: 31)
!323 = distinct !DILexicalBlock(scope: !42, file: !1, line: 122, column: 9)
!324 = !DILocation(line: 127, column: 18, scope: !322)
!325 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attrib", arg: 2, scope: !42, file: !1, line: 117, type: !45)
!326 = !DILocation(line: 117, column: 78, scope: !42)
!327 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uvs", scope: !42, file: !1, line: 119, type: !328)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 192, align: 32, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 3)
!331 = !DILocation(line: 119, column: 12, scope: !42)
!332 = !{i32 0, i32 64, i32 3}
!333 = !{i32 32, i32 64, i32 3}
!334 = !DILocation(line: 119, column: 21, scope: !42)
!335 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !42, file: !1, line: 120, type: !336)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 96, align: 32, elements: !329)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 120, baseType: !51)
!338 = !DILocation(line: 120, column: 10, scope: !42)
!339 = !DILocation(line: 122, column: 16, scope: !323)
!340 = !DILocation(line: 122, column: 9, scope: !42)
!341 = !DILocation(line: 123, column: 15, scope: !322)
!342 = !DILocation(line: 123, column: 32, scope: !322)
!343 = !DILocation(line: 123, column: 13, scope: !322)
!344 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !42, file: !1, line: 121, type: !337)
!345 = !DILocation(line: 121, column: 10, scope: !42)
!346 = !DILocation(line: 124, column: 9, scope: !322)
!347 = !DILocation(line: 124, column: 18, scope: !322)
!348 = !DILocation(line: 125, column: 34, scope: !322)
!349 = !DILocation(line: 125, column: 20, scope: !322)
!350 = !DILocation(line: 125, column: 9, scope: !322)
!351 = !DILocation(line: 125, column: 18, scope: !322)
!352 = !DILocation(line: 126, column: 34, scope: !322)
!353 = !DILocation(line: 126, column: 20, scope: !322)
!354 = !DILocation(line: 126, column: 9, scope: !322)
!355 = !DILocation(line: 126, column: 18, scope: !322)
!356 = !DILocation(line: 127, column: 25, scope: !322)
!357 = !DILocation(line: 127, column: 9, scope: !322)
!358 = !DILocation(line: 127, column: 16, scope: !322)
!359 = !DILocation(line: 128, column: 25, scope: !322)
